/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct std_basic_string {
    pub _address: u8,
}
pub type std_basic_string__Char_alloc_type = u8;
pub type std_basic_string__Alloc_traits = u8;
pub type std_basic_string_traits_type = u8;
pub type std_basic_string_value_type = u8;
pub type std_basic_string_allocator_type = u8;
pub type std_basic_string_size_type = u8;
pub type std_basic_string_difference_type = u8;
pub type std_basic_string_reference = u8;
pub type std_basic_string_const_reference = u8;

pub type std_unique_ptr_element_type = u8;
pub type std_unique_ptr_deleter_type = u8;
pub type std_unique_ptr___safe_conversion_up = u8;
pub type std_atomic_bool = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct std_optional {
    pub _address: u8,
}
pub type std_optional__Base = u8;
pub type std_optional___not_self = u8;
pub type std_optional___not_tag = u8;
pub type std_optional__Requires = u8;
pub type std_optional_value_type = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct std_unordered_map {
    pub _address: u8,
}
pub type std_unordered_map__Hashtable = u8;
pub type std_unordered_map_key_type = u8;
pub type std_unordered_map_value_type = u8;
pub type std_unordered_map_mapped_type = u8;
pub type std_unordered_map_hasher = u8;
pub type std_unordered_map_key_equal = u8;
pub type std_unordered_map_allocator_type = u8;
pub type std_unordered_map_pointer = u8;
pub type std_unordered_map_const_pointer = u8;
pub type std_unordered_map_reference = u8;
pub type std_unordered_map_const_reference = u8;
pub type std_unordered_map_iterator = u8;
pub type std_unordered_map_const_iterator = u8;
pub type std_unordered_map_local_iterator = u8;
pub type std_unordered_map_const_local_iterator = u8;
pub type std_unordered_map_size_type = u8;
pub type std_unordered_map_difference_type = u8;
pub type std_unordered_map_node_type = u8;
pub type std_unordered_map_insert_return_type = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct std_vector {
    pub _address: u8,
}
pub type std_vector__Base = u8;
pub type std_vector__Tp_alloc_type = u8;
pub type std_vector__Alloc_traits = u8;
pub type std_vector_value_type = u8;
pub type std_vector_pointer = u8;
pub type std_vector_const_pointer = u8;
pub type std_vector_reference = u8;
pub type std_vector_const_reference = u8;
pub type std_vector_iterator = u8;
pub type std_vector_const_iterator = u8;
pub type std_vector_const_reverse_iterator = u8;
pub type std_vector_reverse_iterator = u8;
pub type std_vector_size_type = u64;
pub type std_vector_difference_type = u64;
pub type std_vector_allocator_type = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct std_vector__Temporary_value {
    pub _address: u8,
}
pub type size_t = ::std::os::raw::c_ulong;
pub type va_list = __builtin_va_list;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __pid_t = ::std::os::raw::c_int;
pub type __ssize_t = ::std::os::raw::c_long;
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type uid_t = __uid_t;
pub type ssize_t = __ssize_t;
#[doc = " The type used to return success/failure from frameworks APIs."]
#[doc = " See the anonymous enum below for valid values."]
pub type android_status_t = i32;
#[repr(C)]
pub struct android_sp<T> {
    pub m_ptr: *mut T,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_key_value_pair_t<KEY, VALUE> {
    pub key: KEY,
    pub value: VALUE,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<KEY>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<VALUE>>,
}
pub type android_key_value_pair_t_key_t<KEY> = KEY;
pub type android_key_value_pair_t_value_t<VALUE> = VALUE;
#[repr(C)]
pub struct android_RefBase__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
pub struct android_RefBase {
    pub vtable_: *const android_RefBase__bindgen_vtable,
    pub mRefs: *mut android_RefBase_weakref_impl,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_RefBase_weakref_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_android_RefBase_weakref_type() {
    assert_eq!(
        ::std::mem::size_of::<android_RefBase_weakref_type>(),
        1usize,
        concat!("Size of: ", stringify!(android_RefBase_weakref_type))
    );
    assert_eq!(
        ::std::mem::align_of::<android_RefBase_weakref_type>(),
        1usize,
        concat!("Alignment of ", stringify!(android_RefBase_weakref_type))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase12weakref_type7refBaseEv"]
    pub fn android_RefBase_weakref_type_refBase(
        this: *const android_RefBase_weakref_type,
    ) -> *mut android_RefBase;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase12weakref_type7incWeakEPKv"]
    pub fn android_RefBase_weakref_type_incWeak(
        this: *mut android_RefBase_weakref_type,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase12weakref_type7decWeakEPKv"]
    pub fn android_RefBase_weakref_type_decWeak(
        this: *mut android_RefBase_weakref_type,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase12weakref_type16attemptIncStrongEPKv"]
    pub fn android_RefBase_weakref_type_attemptIncStrong(
        this: *mut android_RefBase_weakref_type,
        id: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase12weakref_type14attemptIncWeakEPKv"]
    pub fn android_RefBase_weakref_type_attemptIncWeak(
        this: *mut android_RefBase_weakref_type,
        id: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[doc = "! DEBUGGING ONLY: Get current weak ref count."]
    #[link_name = "\u{1}_ZNK7android7RefBase12weakref_type12getWeakCountEv"]
    pub fn android_RefBase_weakref_type_getWeakCount(
        this: *const android_RefBase_weakref_type,
    ) -> i32;
}
extern "C" {
    #[doc = "! DEBUGGING ONLY: Print references held on object."]
    #[link_name = "\u{1}_ZNK7android7RefBase12weakref_type9printRefsEv"]
    pub fn android_RefBase_weakref_type_printRefs(this: *const android_RefBase_weakref_type);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase12weakref_type7trackMeEbb"]
    pub fn android_RefBase_weakref_type_trackMe(
        this: *mut android_RefBase_weakref_type,
        enable: bool,
        retain: bool,
    );
}
impl android_RefBase_weakref_type {
    #[inline]
    pub unsafe fn refBase(&self) -> *mut android_RefBase {
        android_RefBase_weakref_type_refBase(self)
    }
    #[inline]
    pub unsafe fn incWeak(&mut self, id: *const ::std::os::raw::c_void) {
        android_RefBase_weakref_type_incWeak(self, id)
    }
    #[inline]
    pub unsafe fn decWeak(&mut self, id: *const ::std::os::raw::c_void) {
        android_RefBase_weakref_type_decWeak(self, id)
    }
    #[inline]
    pub unsafe fn attemptIncStrong(&mut self, id: *const ::std::os::raw::c_void) -> bool {
        android_RefBase_weakref_type_attemptIncStrong(self, id)
    }
    #[inline]
    pub unsafe fn attemptIncWeak(&mut self, id: *const ::std::os::raw::c_void) -> bool {
        android_RefBase_weakref_type_attemptIncWeak(self, id)
    }
    #[inline]
    pub unsafe fn getWeakCount(&self) -> i32 {
        android_RefBase_weakref_type_getWeakCount(self)
    }
    #[inline]
    pub unsafe fn printRefs(&self) {
        android_RefBase_weakref_type_printRefs(self)
    }
    #[inline]
    pub unsafe fn trackMe(&mut self, enable: bool, retain: bool) {
        android_RefBase_weakref_type_trackMe(self, enable, retain)
    }
}
pub const android_RefBase_OBJECT_LIFETIME_STRONG: android_RefBase__bindgen_ty_1 = 0;
pub const android_RefBase_OBJECT_LIFETIME_WEAK: android_RefBase__bindgen_ty_1 = 1;
pub const android_RefBase_OBJECT_LIFETIME_MASK: android_RefBase__bindgen_ty_1 = 1;
#[doc = "! Flags for extendObjectLifetime()"]
pub type android_RefBase__bindgen_ty_1 = u32;
pub const android_RefBase_FIRST_INC_STRONG: android_RefBase__bindgen_ty_2 = 1;
#[doc = "! Flags for onIncStrongAttempted()"]
pub type android_RefBase__bindgen_ty_2 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_RefBase_weakref_impl {
    _unused: [u8; 0],
}
#[test]
fn bindgen_test_layout_android_RefBase() {
    assert_eq!(
        ::std::mem::size_of::<android_RefBase>(),
        16usize,
        concat!("Size of: ", stringify!(android_RefBase))
    );
    assert_eq!(
        ::std::mem::align_of::<android_RefBase>(),
        8usize,
        concat!("Alignment of ", stringify!(android_RefBase))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_RefBase>())).mRefs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_RefBase),
            "::",
            stringify!(mRefs)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase9incStrongEPKv"]
    pub fn android_RefBase_incStrong(
        this: *const android_RefBase,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase9decStrongEPKv"]
    pub fn android_RefBase_decStrong(
        this: *const android_RefBase,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase14forceIncStrongEPKv"]
    pub fn android_RefBase_forceIncStrong(
        this: *const android_RefBase,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "! DEBUGGING ONLY: Get current strong ref count."]
    #[link_name = "\u{1}_ZNK7android7RefBase14getStrongCountEv"]
    pub fn android_RefBase_getStrongCount(this: *const android_RefBase) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase10createWeakEPKv"]
    pub fn android_RefBase_createWeak(
        this: *const android_RefBase,
        id: *const ::std::os::raw::c_void,
    ) -> *mut android_RefBase_weakref_type;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7RefBase11getWeakRefsEv"]
    pub fn android_RefBase_getWeakRefs(
        this: *const android_RefBase,
    ) -> *mut android_RefBase_weakref_type;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase20extendObjectLifetimeEi"]
    pub fn android_RefBase_extendObjectLifetime(this: *mut android_RefBase, mode: i32);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBaseC1Ev"]
    pub fn android_RefBase_RefBase(this: *mut android_RefBase);
}
impl android_RefBase {
    #[inline]
    pub unsafe fn incStrong(&self, id: *const ::std::os::raw::c_void) {
        android_RefBase_incStrong(self, id)
    }
    #[inline]
    pub unsafe fn decStrong(&self, id: *const ::std::os::raw::c_void) {
        android_RefBase_decStrong(self, id)
    }
    #[inline]
    pub unsafe fn forceIncStrong(&self, id: *const ::std::os::raw::c_void) {
        android_RefBase_forceIncStrong(self, id)
    }
    #[inline]
    pub unsafe fn getStrongCount(&self) -> i32 {
        android_RefBase_getStrongCount(self)
    }
    #[inline]
    pub unsafe fn createWeak(
        &self,
        id: *const ::std::os::raw::c_void,
    ) -> *mut android_RefBase_weakref_type {
        android_RefBase_createWeak(self, id)
    }
    #[inline]
    pub unsafe fn getWeakRefs(&self) -> *mut android_RefBase_weakref_type {
        android_RefBase_getWeakRefs(self)
    }
    #[inline]
    pub unsafe fn extendObjectLifetime(&mut self, mode: i32) {
        android_RefBase_extendObjectLifetime(self, mode)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_RefBase_RefBase(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBaseD1Ev"]
    pub fn android_RefBase_RefBase_destructor(this: *mut android_RefBase);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase10onFirstRefEv"]
    pub fn android_RefBase_onFirstRef(this: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase15onLastStrongRefEPKv"]
    pub fn android_RefBase_onLastStrongRef(
        this: *mut ::std::os::raw::c_void,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase20onIncStrongAttemptedEjPKv"]
    pub fn android_RefBase_onIncStrongAttempted(
        this: *mut ::std::os::raw::c_void,
        flags: u32,
        id: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7RefBase13onLastWeakRefEPKv"]
    pub fn android_RefBase_onLastWeakRef(
        this: *mut ::std::os::raw::c_void,
        id: *const ::std::os::raw::c_void,
    );
}
#[repr(C)]
pub struct android_wp<T> {
    pub m_ptr: *mut T,
    pub m_refs: *mut android_wp_weakref_type,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
pub type android_wp_weakref_type = android_RefBase_weakref_type;
#[doc = "! This is a string holding UTF-8 characters. Does not allow the value more"]
#[repr(C)]
pub struct android_String8 {
    pub mString: *const ::std::os::raw::c_char,
}
pub const android_String8_StaticLinkage_kEmptyString: android_String8_StaticLinkage = 0;
pub type android_String8_StaticLinkage = u32;
#[test]
fn bindgen_test_layout_android_String8() {
    assert_eq!(
        ::std::mem::size_of::<android_String8>(),
        8usize,
        concat!("Size of: ", stringify!(android_String8))
    );
    assert_eq!(
        ::std::mem::align_of::<android_String8>(),
        8usize,
        concat!("Alignment of ", stringify!(android_String8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_String8>())).mString as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_String8),
            "::",
            stringify!(mString)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String86formatEPKcz"]
    pub fn android_String8_format(fmt: *const ::std::os::raw::c_char, ...) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String87formatVEPKcP13__va_list_tag"]
    pub fn android_String8_formatV(
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String86lengthEv"]
    pub fn android_String8_length(this: *const android_String8) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85clearEv"]
    pub fn android_String8_clear(this: *mut android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85setToERKS0_"]
    pub fn android_String8_setTo(this: *mut android_String8, other: *const android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85setToEPKc"]
    pub fn android_String8_setTo1(
        this: *mut android_String8,
        other: *const ::std::os::raw::c_char,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85setToEPKcm"]
    pub fn android_String8_setTo2(
        this: *mut android_String8,
        other: *const ::std::os::raw::c_char,
        numChars: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85setToEPKDsm"]
    pub fn android_String8_setTo3(
        this: *mut android_String8,
        other: *const u16,
        numChars: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String85setToEPKDim"]
    pub fn android_String8_setTo4(
        this: *mut android_String8,
        other: *const u32,
        length: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String86appendERKS0_"]
    pub fn android_String8_append(
        this: *mut android_String8,
        other: *const android_String8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String86appendEPKc"]
    pub fn android_String8_append1(
        this: *mut android_String8,
        other: *const ::std::os::raw::c_char,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String86appendEPKcm"]
    pub fn android_String8_append2(
        this: *mut android_String8,
        other: *const ::std::os::raw::c_char,
        numChars: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String812appendFormatEPKcz"]
    pub fn android_String8_appendFormat(
        this: *mut android_String8,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String813appendFormatVEPKcP13__va_list_tag"]
    pub fn android_String8_appendFormatV(
        this: *mut android_String8,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String810lockBufferEm"]
    pub fn android_String8_lockBuffer(
        this: *mut android_String8,
        size: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String812unlockBufferEv"]
    pub fn android_String8_unlockBuffer(this: *mut android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String812unlockBufferEm"]
    pub fn android_String8_unlockBuffer1(
        this: *mut android_String8,
        size: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String84findEPKcm"]
    pub fn android_String8_find(
        this: *const android_String8,
        other: *const ::std::os::raw::c_char,
        start: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String89removeAllEPKc"]
    pub fn android_String8_removeAll(
        this: *mut android_String8,
        other: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String87toLowerEv"]
    pub fn android_String8_toLower(this: *mut android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String87toLowerEmm"]
    pub fn android_String8_toLower1(this: *mut android_String8, start: size_t, numChars: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String87toUpperEv"]
    pub fn android_String8_toUpper(this: *mut android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String87toUpperEmm"]
    pub fn android_String8_toUpper1(this: *mut android_String8, start: size_t, numChars: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String811setPathNameEPKc"]
    pub fn android_String8_setPathName(
        this: *mut android_String8,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String811setPathNameEPKcm"]
    pub fn android_String8_setPathName1(
        this: *mut android_String8,
        name: *const ::std::os::raw::c_char,
        numChars: size_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String811getPathLeafEv"]
    pub fn android_String8_getPathLeaf(this: *const android_String8) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String810getPathDirEv"]
    pub fn android_String8_getPathDir(this: *const android_String8) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String88walkPathEPS0_"]
    pub fn android_String8_walkPath(
        this: *const android_String8,
        outRemains: *mut android_String8,
    ) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String816getPathExtensionEv"]
    pub fn android_String8_getPathExtension(this: *const android_String8) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7String811getBasePathEv"]
    pub fn android_String8_getBasePath(this: *const android_String8) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String810appendPathEPKc"]
    pub fn android_String8_appendPath(
        this: *mut android_String8,
        leaf: *const ::std::os::raw::c_char,
    ) -> *mut android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String816convertToResPathEv"]
    pub fn android_String8_convertToResPath(this: *mut android_String8) -> *mut android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1Ev"]
    pub fn android_String8_String8(this: *mut android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1ENS0_13StaticLinkageE"]
    pub fn android_String8_String81(
        this: *mut android_String8,
        arg1: android_String8_StaticLinkage,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1ERKS0_"]
    pub fn android_String8_String82(this: *mut android_String8, o: *const android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKc"]
    pub fn android_String8_String83(this: *mut android_String8, o: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKcm"]
    pub fn android_String8_String84(
        this: *mut android_String8,
        o: *const ::std::os::raw::c_char,
        numChars: size_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1ERKNS_8String16E"]
    pub fn android_String8_String85(this: *mut android_String8, o: *const android_String16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKDs"]
    pub fn android_String8_String86(this: *mut android_String8, o: *const u16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKDsm"]
    pub fn android_String8_String87(this: *mut android_String8, o: *const u16, numChars: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKDi"]
    pub fn android_String8_String88(this: *mut android_String8, o: *const u32);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8C1EPKDim"]
    pub fn android_String8_String89(this: *mut android_String8, o: *const u32, numChars: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7String8D1Ev"]
    pub fn android_String8_String8_destructor(this: *mut android_String8);
}
impl android_String8 {
    #[inline]
    pub unsafe fn formatV(
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> android_String8 {
        android_String8_formatV(fmt, args)
    }
    #[inline]
    pub unsafe fn length(&self) -> size_t {
        android_String8_length(self)
    }
    #[inline]
    pub unsafe fn clear(&mut self) {
        android_String8_clear(self)
    }
    #[inline]
    pub unsafe fn setTo(&mut self, other: *const android_String8) {
        android_String8_setTo(self, other)
    }
    #[inline]
    pub unsafe fn setTo1(&mut self, other: *const ::std::os::raw::c_char) -> android_status_t {
        android_String8_setTo1(self, other)
    }
    #[inline]
    pub unsafe fn setTo2(
        &mut self,
        other: *const ::std::os::raw::c_char,
        numChars: size_t,
    ) -> android_status_t {
        android_String8_setTo2(self, other, numChars)
    }
    #[inline]
    pub unsafe fn setTo3(&mut self, other: *const u16, numChars: size_t) -> android_status_t {
        android_String8_setTo3(self, other, numChars)
    }
    #[inline]
    pub unsafe fn setTo4(&mut self, other: *const u32, length: size_t) -> android_status_t {
        android_String8_setTo4(self, other, length)
    }
    #[inline]
    pub unsafe fn append(&mut self, other: *const android_String8) -> android_status_t {
        android_String8_append(self, other)
    }
    #[inline]
    pub unsafe fn append1(&mut self, other: *const ::std::os::raw::c_char) -> android_status_t {
        android_String8_append1(self, other)
    }
    #[inline]
    pub unsafe fn append2(
        &mut self,
        other: *const ::std::os::raw::c_char,
        numChars: size_t,
    ) -> android_status_t {
        android_String8_append2(self, other, numChars)
    }
    #[inline]
    pub unsafe fn appendFormatV(
        &mut self,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> android_status_t {
        android_String8_appendFormatV(self, fmt, args)
    }
    #[inline]
    pub unsafe fn lockBuffer(&mut self, size: size_t) -> *mut ::std::os::raw::c_char {
        android_String8_lockBuffer(self, size)
    }
    #[inline]
    pub unsafe fn unlockBuffer(&mut self) {
        android_String8_unlockBuffer(self)
    }
    #[inline]
    pub unsafe fn unlockBuffer1(&mut self, size: size_t) -> android_status_t {
        android_String8_unlockBuffer1(self, size)
    }
    #[inline]
    pub unsafe fn find(&self, other: *const ::std::os::raw::c_char, start: size_t) -> ssize_t {
        android_String8_find(self, other, start)
    }
    #[inline]
    pub unsafe fn removeAll(&mut self, other: *const ::std::os::raw::c_char) -> bool {
        android_String8_removeAll(self, other)
    }
    #[inline]
    pub unsafe fn toLower(&mut self) {
        android_String8_toLower(self)
    }
    #[inline]
    pub unsafe fn toLower1(&mut self, start: size_t, numChars: size_t) {
        android_String8_toLower1(self, start, numChars)
    }
    #[inline]
    pub unsafe fn toUpper(&mut self) {
        android_String8_toUpper(self)
    }
    #[inline]
    pub unsafe fn toUpper1(&mut self, start: size_t, numChars: size_t) {
        android_String8_toUpper1(self, start, numChars)
    }
    #[inline]
    pub unsafe fn setPathName(&mut self, name: *const ::std::os::raw::c_char) {
        android_String8_setPathName(self, name)
    }
    #[inline]
    pub unsafe fn setPathName1(&mut self, name: *const ::std::os::raw::c_char, numChars: size_t) {
        android_String8_setPathName1(self, name, numChars)
    }
    #[inline]
    pub unsafe fn getPathLeaf(&self) -> android_String8 {
        android_String8_getPathLeaf(self)
    }
    #[inline]
    pub unsafe fn getPathDir(&self) -> android_String8 {
        android_String8_getPathDir(self)
    }
    #[inline]
    pub unsafe fn walkPath(&self, outRemains: *mut android_String8) -> android_String8 {
        android_String8_walkPath(self, outRemains)
    }
    #[inline]
    pub unsafe fn getPathExtension(&self) -> android_String8 {
        android_String8_getPathExtension(self)
    }
    #[inline]
    pub unsafe fn getBasePath(&self) -> android_String8 {
        android_String8_getBasePath(self)
    }
    #[inline]
    pub unsafe fn appendPath(
        &mut self,
        leaf: *const ::std::os::raw::c_char,
    ) -> *mut android_String8 {
        android_String8_appendPath(self, leaf)
    }
    #[inline]
    pub unsafe fn convertToResPath(&mut self) -> *mut android_String8 {
        android_String8_convertToResPath(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String8(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: android_String8_StaticLinkage) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String81(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(o: *const android_String8) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String82(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(o: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String83(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(o: *const ::std::os::raw::c_char, numChars: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String84(__bindgen_tmp.as_mut_ptr(), o, numChars);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(o: *const android_String16) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String85(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(o: *const u16) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String86(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(o: *const u16, numChars: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String87(__bindgen_tmp.as_mut_ptr(), o, numChars);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new8(o: *const u32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String88(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new9(o: *const u32, numChars: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String8_String89(__bindgen_tmp.as_mut_ptr(), o, numChars);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_String8_String8_destructor(self)
    }
}
#[doc = "! This is a string holding UTF-16 characters."]
#[repr(C)]
pub struct android_String16 {
    pub mString: *const u16,
}
pub const android_String16_StaticLinkage_kEmptyString: android_String16_StaticLinkage = 0;
pub type android_String16_StaticLinkage = u32;
pub const android_String16_kIsSharedBufferAllocated: u32 = 2147483648;
#[test]
fn bindgen_test_layout_android_String16() {
    assert_eq!(
        ::std::mem::size_of::<android_String16>(),
        8usize,
        concat!("Size of: ", stringify!(android_String16))
    );
    assert_eq!(
        ::std::mem::align_of::<android_String16>(),
        8usize,
        concat!("Alignment of ", stringify!(android_String16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_String16>())).mString as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_String16),
            "::",
            stringify!(mString)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String164sizeEv"]
    pub fn android_String16_size(this: *const android_String16) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String165setToERKS0_"]
    pub fn android_String16_setTo(this: *mut android_String16, other: *const android_String16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String165setToEPKDs"]
    pub fn android_String16_setTo1(
        this: *mut android_String16,
        other: *const u16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String165setToEPKDsm"]
    pub fn android_String16_setTo2(
        this: *mut android_String16,
        other: *const u16,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String165setToERKS0_mm"]
    pub fn android_String16_setTo3(
        this: *mut android_String16,
        other: *const android_String16,
        len: size_t,
        begin: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String166appendERKS0_"]
    pub fn android_String16_append(
        this: *mut android_String16,
        other: *const android_String16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String166appendEPKDsm"]
    pub fn android_String16_append1(
        this: *mut android_String16,
        other: *const u16,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String166insertEmPKDs"]
    pub fn android_String16_insert(
        this: *mut android_String16,
        pos: size_t,
        chrs: *const u16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String166insertEmPKDsm"]
    pub fn android_String16_insert1(
        this: *mut android_String16,
        pos: size_t,
        chrs: *const u16,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String169findFirstEDs"]
    pub fn android_String16_findFirst(this: *const android_String16, c: u16) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String168findLastEDs"]
    pub fn android_String16_findLast(this: *const android_String16, c: u16) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String1610startsWithERKS0_"]
    pub fn android_String16_startsWith(
        this: *const android_String16,
        prefix: *const android_String16,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String1610startsWithEPKDs"]
    pub fn android_String16_startsWith1(this: *const android_String16, prefix: *const u16) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String168containsEPKDs"]
    pub fn android_String16_contains(this: *const android_String16, chrs: *const u16) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String169makeLowerEv"]
    pub fn android_String16_makeLower(this: *mut android_String16) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String1610replaceAllEDsDs"]
    pub fn android_String16_replaceAll(
        this: *mut android_String16,
        replaceThis: u16,
        withThis: u16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String166removeEmm"]
    pub fn android_String16_remove(
        this: *mut android_String16,
        len: size_t,
        begin: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8String1614isStaticStringEv"]
    pub fn android_String16_isStaticString(this: *const android_String16) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1Ev"]
    pub fn android_String16_String16(this: *mut android_String16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1ENS0_13StaticLinkageE"]
    pub fn android_String16_String161(
        this: *mut android_String16,
        arg1: android_String16_StaticLinkage,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1ERKS0_"]
    pub fn android_String16_String162(this: *mut android_String16, o: *const android_String16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1ERKS0_mm"]
    pub fn android_String16_String163(
        this: *mut android_String16,
        o: *const android_String16,
        len: size_t,
        begin: size_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1EPKDs"]
    pub fn android_String16_String164(this: *mut android_String16, o: *const u16);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1EPKDsm"]
    pub fn android_String16_String165(this: *mut android_String16, o: *const u16, len: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1ERKNS_7String8E"]
    pub fn android_String16_String166(this: *mut android_String16, o: *const android_String8);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1EPKc"]
    pub fn android_String16_String167(
        this: *mut android_String16,
        o: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16C1EPKcm"]
    pub fn android_String16_String168(
        this: *mut android_String16,
        o: *const ::std::os::raw::c_char,
        len: size_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8String16D1Ev"]
    pub fn android_String16_String16_destructor(this: *mut android_String16);
}
impl android_String16 {
    #[inline]
    pub unsafe fn size(&self) -> size_t {
        android_String16_size(self)
    }
    #[inline]
    pub unsafe fn setTo(&mut self, other: *const android_String16) {
        android_String16_setTo(self, other)
    }
    #[inline]
    pub unsafe fn setTo1(&mut self, other: *const u16) -> android_status_t {
        android_String16_setTo1(self, other)
    }
    #[inline]
    pub unsafe fn setTo2(&mut self, other: *const u16, len: size_t) -> android_status_t {
        android_String16_setTo2(self, other, len)
    }
    #[inline]
    pub unsafe fn setTo3(
        &mut self,
        other: *const android_String16,
        len: size_t,
        begin: size_t,
    ) -> android_status_t {
        android_String16_setTo3(self, other, len, begin)
    }
    #[inline]
    pub unsafe fn append(&mut self, other: *const android_String16) -> android_status_t {
        android_String16_append(self, other)
    }
    #[inline]
    pub unsafe fn append1(&mut self, other: *const u16, len: size_t) -> android_status_t {
        android_String16_append1(self, other, len)
    }
    #[inline]
    pub unsafe fn insert(&mut self, pos: size_t, chrs: *const u16) -> android_status_t {
        android_String16_insert(self, pos, chrs)
    }
    #[inline]
    pub unsafe fn insert1(
        &mut self,
        pos: size_t,
        chrs: *const u16,
        len: size_t,
    ) -> android_status_t {
        android_String16_insert1(self, pos, chrs, len)
    }
    #[inline]
    pub unsafe fn findFirst(&self, c: u16) -> ssize_t {
        android_String16_findFirst(self, c)
    }
    #[inline]
    pub unsafe fn findLast(&self, c: u16) -> ssize_t {
        android_String16_findLast(self, c)
    }
    #[inline]
    pub unsafe fn startsWith(&self, prefix: *const android_String16) -> bool {
        android_String16_startsWith(self, prefix)
    }
    #[inline]
    pub unsafe fn startsWith1(&self, prefix: *const u16) -> bool {
        android_String16_startsWith1(self, prefix)
    }
    #[inline]
    pub unsafe fn contains(&self, chrs: *const u16) -> bool {
        android_String16_contains(self, chrs)
    }
    #[inline]
    pub unsafe fn makeLower(&mut self) -> android_status_t {
        android_String16_makeLower(self)
    }
    #[inline]
    pub unsafe fn replaceAll(&mut self, replaceThis: u16, withThis: u16) -> android_status_t {
        android_String16_replaceAll(self, replaceThis, withThis)
    }
    #[inline]
    pub unsafe fn remove(&mut self, len: size_t, begin: size_t) -> android_status_t {
        android_String16_remove(self, len, begin)
    }
    #[inline]
    pub unsafe fn isStaticString(&self) -> bool {
        android_String16_isStaticString(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String16(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: android_String16_StaticLinkage) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String161(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(o: *const android_String16) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String162(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(o: *const android_String16, len: size_t, begin: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String163(__bindgen_tmp.as_mut_ptr(), o, len, begin);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(o: *const u16) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String164(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(o: *const u16, len: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String165(__bindgen_tmp.as_mut_ptr(), o, len);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(o: *const android_String8) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String166(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(o: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String167(__bindgen_tmp.as_mut_ptr(), o);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new8(o: *const ::std::os::raw::c_char, len: size_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_String16_String168(__bindgen_tmp.as_mut_ptr(), o, len);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_String16_String16_destructor(self)
    }
}
#[repr(C)]
pub struct android_VectorImpl__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Implementation of the guts of the vector<> class"]
#[doc = " this ensures backward binary compatibility and"]
#[doc = " reduces code size."]
#[doc = " For performance reasons, we expose mStorage and mCount"]
#[doc = " so these fields are set in stone."]
#[doc = ""]
#[repr(C)]
pub struct android_VectorImpl {
    pub vtable_: *const android_VectorImpl__bindgen_vtable,
    pub mStorage: *mut ::std::os::raw::c_void,
    pub mCount: size_t,
    pub mFlags: u32,
    pub mItemSize: size_t,
}
pub const android_VectorImpl_HAS_TRIVIAL_CTOR: android_VectorImpl__bindgen_ty_1 = 1;
pub const android_VectorImpl_HAS_TRIVIAL_DTOR: android_VectorImpl__bindgen_ty_1 = 2;
pub const android_VectorImpl_HAS_TRIVIAL_COPY: android_VectorImpl__bindgen_ty_1 = 4;
pub type android_VectorImpl__bindgen_ty_1 = u32;
pub type android_VectorImpl_compar_t = ::std::option::Option<
    unsafe extern "C" fn(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type android_VectorImpl_compar_r_t = ::std::option::Option<
    unsafe extern "C" fn(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[test]
fn bindgen_test_layout_android_VectorImpl() {
    assert_eq!(
        ::std::mem::size_of::<android_VectorImpl>(),
        40usize,
        concat!("Size of: ", stringify!(android_VectorImpl))
    );
    assert_eq!(
        ::std::mem::align_of::<android_VectorImpl>(),
        8usize,
        concat!("Alignment of ", stringify!(android_VectorImpl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_VectorImpl>())).mStorage as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_VectorImpl),
            "::",
            stringify!(mStorage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_VectorImpl>())).mCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_VectorImpl),
            "::",
            stringify!(mCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_VectorImpl>())).mFlags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_VectorImpl),
            "::",
            stringify!(mFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_VectorImpl>())).mItemSize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(android_VectorImpl),
            "::",
            stringify!(mItemSize)
        )
    );
}
extern "C" {
    #[doc = " must be called from subclasses destructor"]
    #[link_name = "\u{1}_ZN7android10VectorImpl13finish_vectorEv"]
    pub fn android_VectorImpl_finish_vector(this: *mut android_VectorImpl);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl13editArrayImplEv"]
    pub fn android_VectorImpl_editArrayImpl(
        this: *mut android_VectorImpl,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android10VectorImpl8capacityEv"]
    pub fn android_VectorImpl_capacity(this: *const android_VectorImpl) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl11setCapacityEm"]
    pub fn android_VectorImpl_setCapacity(this: *mut android_VectorImpl, size: size_t) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl6resizeEm"]
    pub fn android_VectorImpl_resize(this: *mut android_VectorImpl, size: size_t) -> ssize_t;
}
extern "C" {
    #[doc = " append/insert another vector or array"]
    #[link_name = "\u{1}_ZN7android10VectorImpl14insertVectorAtERKS0_m"]
    pub fn android_VectorImpl_insertVectorAt(
        this: *mut android_VectorImpl,
        vector: *const android_VectorImpl,
        index: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl12appendVectorERKS0_"]
    pub fn android_VectorImpl_appendVector(
        this: *mut android_VectorImpl,
        vector: *const android_VectorImpl,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl13insertArrayAtEPKvmm"]
    pub fn android_VectorImpl_insertArrayAt(
        this: *mut android_VectorImpl,
        array: *const ::std::os::raw::c_void,
        index: size_t,
        length: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl11appendArrayEPKvm"]
    pub fn android_VectorImpl_appendArray(
        this: *mut android_VectorImpl,
        array: *const ::std::os::raw::c_void,
        length: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " add/insert/replace items"]
    #[link_name = "\u{1}_ZN7android10VectorImpl8insertAtEmm"]
    pub fn android_VectorImpl_insertAt(
        this: *mut android_VectorImpl,
        where_: size_t,
        numItems: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl8insertAtEPKvmm"]
    pub fn android_VectorImpl_insertAt1(
        this: *mut android_VectorImpl,
        item: *const ::std::os::raw::c_void,
        where_: size_t,
        numItems: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl3popEv"]
    pub fn android_VectorImpl_pop(this: *mut android_VectorImpl);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl4pushEv"]
    pub fn android_VectorImpl_push(this: *mut android_VectorImpl);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl4pushEPKv"]
    pub fn android_VectorImpl_push1(
        this: *mut android_VectorImpl,
        item: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl3addEv"]
    pub fn android_VectorImpl_add(this: *mut android_VectorImpl) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl3addEPKv"]
    pub fn android_VectorImpl_add1(
        this: *mut android_VectorImpl,
        item: *const ::std::os::raw::c_void,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl9replaceAtEm"]
    pub fn android_VectorImpl_replaceAt(this: *mut android_VectorImpl, index: size_t) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl9replaceAtEPKvm"]
    pub fn android_VectorImpl_replaceAt1(
        this: *mut android_VectorImpl,
        item: *const ::std::os::raw::c_void,
        index: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[doc = " remove items"]
    #[link_name = "\u{1}_ZN7android10VectorImpl13removeItemsAtEmm"]
    pub fn android_VectorImpl_removeItemsAt(
        this: *mut android_VectorImpl,
        index: size_t,
        count: size_t,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl5clearEv"]
    pub fn android_VectorImpl_clear(this: *mut android_VectorImpl);
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android10VectorImpl12itemLocationEm"]
    pub fn android_VectorImpl_itemLocation(
        this: *const android_VectorImpl,
        index: size_t,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl16editItemLocationEm"]
    pub fn android_VectorImpl_editItemLocation(
        this: *mut android_VectorImpl,
        index: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl4sortEPFiPKvS2_E"]
    pub fn android_VectorImpl_sort(
        this: *mut android_VectorImpl,
        cmp: android_VectorImpl_compar_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl4sortEPFiPKvS2_PvES3_"]
    pub fn android_VectorImpl_sort1(
        this: *mut android_VectorImpl,
        cmp: android_VectorImpl_compar_r_t,
        state: *mut ::std::os::raw::c_void,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android10VectorImpl8itemSizeEv"]
    pub fn android_VectorImpl_itemSize(this: *const android_VectorImpl) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImpl15release_storageEv"]
    pub fn android_VectorImpl_release_storage(this: *mut android_VectorImpl);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImplC2Emj"]
    pub fn android_VectorImpl_VectorImpl(
        this: *mut android_VectorImpl,
        itemSize: size_t,
        flags: u32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImplC2ERKS0_"]
    pub fn android_VectorImpl_VectorImpl1(
        this: *mut android_VectorImpl,
        rhs: *const android_VectorImpl,
    );
}
impl android_VectorImpl {
    #[inline]
    pub unsafe fn finish_vector(&mut self) {
        android_VectorImpl_finish_vector(self)
    }
    #[inline]
    pub unsafe fn editArrayImpl(&mut self) -> *mut ::std::os::raw::c_void {
        android_VectorImpl_editArrayImpl(self)
    }
    #[inline]
    pub unsafe fn capacity(&self) -> size_t {
        android_VectorImpl_capacity(self)
    }
    #[inline]
    pub unsafe fn setCapacity(&mut self, size: size_t) -> ssize_t {
        android_VectorImpl_setCapacity(self, size)
    }
    #[inline]
    pub unsafe fn resize(&mut self, size: size_t) -> ssize_t {
        android_VectorImpl_resize(self, size)
    }
    #[inline]
    pub unsafe fn insertVectorAt(
        &mut self,
        vector: *const android_VectorImpl,
        index: size_t,
    ) -> ssize_t {
        android_VectorImpl_insertVectorAt(self, vector, index)
    }
    #[inline]
    pub unsafe fn appendVector(&mut self, vector: *const android_VectorImpl) -> ssize_t {
        android_VectorImpl_appendVector(self, vector)
    }
    #[inline]
    pub unsafe fn insertArrayAt(
        &mut self,
        array: *const ::std::os::raw::c_void,
        index: size_t,
        length: size_t,
    ) -> ssize_t {
        android_VectorImpl_insertArrayAt(self, array, index, length)
    }
    #[inline]
    pub unsafe fn appendArray(
        &mut self,
        array: *const ::std::os::raw::c_void,
        length: size_t,
    ) -> ssize_t {
        android_VectorImpl_appendArray(self, array, length)
    }
    #[inline]
    pub unsafe fn insertAt(&mut self, where_: size_t, numItems: size_t) -> ssize_t {
        android_VectorImpl_insertAt(self, where_, numItems)
    }
    #[inline]
    pub unsafe fn insertAt1(
        &mut self,
        item: *const ::std::os::raw::c_void,
        where_: size_t,
        numItems: size_t,
    ) -> ssize_t {
        android_VectorImpl_insertAt1(self, item, where_, numItems)
    }
    #[inline]
    pub unsafe fn pop(&mut self) {
        android_VectorImpl_pop(self)
    }
    #[inline]
    pub unsafe fn push(&mut self) {
        android_VectorImpl_push(self)
    }
    #[inline]
    pub unsafe fn push1(&mut self, item: *const ::std::os::raw::c_void) {
        android_VectorImpl_push1(self, item)
    }
    #[inline]
    pub unsafe fn add(&mut self) -> ssize_t {
        android_VectorImpl_add(self)
    }
    #[inline]
    pub unsafe fn add1(&mut self, item: *const ::std::os::raw::c_void) -> ssize_t {
        android_VectorImpl_add1(self, item)
    }
    #[inline]
    pub unsafe fn replaceAt(&mut self, index: size_t) -> ssize_t {
        android_VectorImpl_replaceAt(self, index)
    }
    #[inline]
    pub unsafe fn replaceAt1(
        &mut self,
        item: *const ::std::os::raw::c_void,
        index: size_t,
    ) -> ssize_t {
        android_VectorImpl_replaceAt1(self, item, index)
    }
    #[inline]
    pub unsafe fn removeItemsAt(&mut self, index: size_t, count: size_t) -> ssize_t {
        android_VectorImpl_removeItemsAt(self, index, count)
    }
    #[inline]
    pub unsafe fn clear(&mut self) {
        android_VectorImpl_clear(self)
    }
    #[inline]
    pub unsafe fn itemLocation(&self, index: size_t) -> *const ::std::os::raw::c_void {
        android_VectorImpl_itemLocation(self, index)
    }
    #[inline]
    pub unsafe fn editItemLocation(&mut self, index: size_t) -> *mut ::std::os::raw::c_void {
        android_VectorImpl_editItemLocation(self, index)
    }
    #[inline]
    pub unsafe fn sort(&mut self, cmp: android_VectorImpl_compar_t) -> android_status_t {
        android_VectorImpl_sort(self, cmp)
    }
    #[inline]
    pub unsafe fn sort1(
        &mut self,
        cmp: android_VectorImpl_compar_r_t,
        state: *mut ::std::os::raw::c_void,
    ) -> android_status_t {
        android_VectorImpl_sort1(self, cmp, state)
    }
    #[inline]
    pub unsafe fn itemSize(&self) -> size_t {
        android_VectorImpl_itemSize(self)
    }
    #[inline]
    pub unsafe fn release_storage(&mut self) {
        android_VectorImpl_release_storage(self)
    }
    #[inline]
    pub unsafe fn new(itemSize: size_t, flags: u32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_VectorImpl_VectorImpl(__bindgen_tmp.as_mut_ptr(), itemSize, flags);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const android_VectorImpl) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_VectorImpl_VectorImpl1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10VectorImplD1Ev"]
    pub fn android_VectorImpl_VectorImpl_destructor(this: *mut android_VectorImpl);
}
#[repr(C)]
pub struct android_SortedVectorImpl {
    pub _base: android_VectorImpl,
}
#[test]
fn bindgen_test_layout_android_SortedVectorImpl() {
    assert_eq!(
        ::std::mem::size_of::<android_SortedVectorImpl>(),
        40usize,
        concat!("Size of: ", stringify!(android_SortedVectorImpl))
    );
    assert_eq!(
        ::std::mem::align_of::<android_SortedVectorImpl>(),
        8usize,
        concat!("Alignment of ", stringify!(android_SortedVectorImpl))
    );
}
extern "C" {
    #[doc = "! finds the index of an item"]
    #[link_name = "\u{1}_ZNK7android16SortedVectorImpl7indexOfEPKv"]
    pub fn android_SortedVectorImpl_indexOf(
        this: *const android_SortedVectorImpl,
        item: *const ::std::os::raw::c_void,
    ) -> ssize_t;
}
extern "C" {
    #[doc = "! finds where this item should be inserted"]
    #[link_name = "\u{1}_ZNK7android16SortedVectorImpl7orderOfEPKv"]
    pub fn android_SortedVectorImpl_orderOf(
        this: *const android_SortedVectorImpl,
        item: *const ::std::os::raw::c_void,
    ) -> size_t;
}
extern "C" {
    #[doc = "! add an item in the right place (or replaces it if there is one)"]
    #[link_name = "\u{1}_ZN7android16SortedVectorImpl3addEPKv"]
    pub fn android_SortedVectorImpl_add(
        this: *mut android_SortedVectorImpl,
        item: *const ::std::os::raw::c_void,
    ) -> ssize_t;
}
extern "C" {
    #[doc = "! merges a vector into this one"]
    #[link_name = "\u{1}_ZN7android16SortedVectorImpl5mergeERKNS_10VectorImplE"]
    pub fn android_SortedVectorImpl_merge(
        this: *mut android_SortedVectorImpl,
        vector: *const android_VectorImpl,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android16SortedVectorImpl5mergeERKS0_"]
    pub fn android_SortedVectorImpl_merge1(
        this: *mut android_SortedVectorImpl,
        vector: *const android_SortedVectorImpl,
    ) -> ssize_t;
}
extern "C" {
    #[doc = "! removes an item"]
    #[link_name = "\u{1}_ZN7android16SortedVectorImpl6removeEPKv"]
    pub fn android_SortedVectorImpl_remove(
        this: *mut android_SortedVectorImpl,
        item: *const ::std::os::raw::c_void,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android16SortedVectorImplC2Emj"]
    pub fn android_SortedVectorImpl_SortedVectorImpl(
        this: *mut android_SortedVectorImpl,
        itemSize: size_t,
        flags: u32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android16SortedVectorImplC2ERKNS_10VectorImplE"]
    pub fn android_SortedVectorImpl_SortedVectorImpl1(
        this: *mut android_SortedVectorImpl,
        rhs: *const android_VectorImpl,
    );
}
impl android_SortedVectorImpl {
    #[inline]
    pub unsafe fn indexOf(&self, item: *const ::std::os::raw::c_void) -> ssize_t {
        android_SortedVectorImpl_indexOf(self, item)
    }
    #[inline]
    pub unsafe fn orderOf(&self, item: *const ::std::os::raw::c_void) -> size_t {
        android_SortedVectorImpl_orderOf(self, item)
    }
    #[inline]
    pub unsafe fn add(&mut self, item: *const ::std::os::raw::c_void) -> ssize_t {
        android_SortedVectorImpl_add(self, item)
    }
    #[inline]
    pub unsafe fn merge(&mut self, vector: *const android_VectorImpl) -> ssize_t {
        android_SortedVectorImpl_merge(self, vector)
    }
    #[inline]
    pub unsafe fn merge1(&mut self, vector: *const android_SortedVectorImpl) -> ssize_t {
        android_SortedVectorImpl_merge1(self, vector)
    }
    #[inline]
    pub unsafe fn remove(&mut self, item: *const ::std::os::raw::c_void) -> ssize_t {
        android_SortedVectorImpl_remove(self, item)
    }
    #[inline]
    pub unsafe fn new(itemSize: size_t, flags: u32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_SortedVectorImpl_SortedVectorImpl(__bindgen_tmp.as_mut_ptr(), itemSize, flags);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const android_VectorImpl) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_SortedVectorImpl_SortedVectorImpl1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7android16SortedVectorImplD1Ev"]
    pub fn android_SortedVectorImpl_SortedVectorImpl_destructor(
        this: *mut android_SortedVectorImpl,
    );
}
#[doc = " The main templated vector class ensuring type safety"]
#[doc = " while making use of VectorImpl."]
#[doc = " This is the class users want to use."]
#[doc = ""]
#[doc = " DO NOT USE: please use std::vector"]
#[repr(C)]
pub struct android_Vector {
    pub _base: android_VectorImpl,
}
pub type android_Vector_value_type<TYPE> = TYPE;
#[doc = " sort (stable) the array"]
pub type android_Vector_compar_t<TYPE> = ::std::option::Option<
    unsafe extern "C" fn(lhs: *const TYPE, rhs: *const TYPE) -> ::std::os::raw::c_int,
>;
pub type android_Vector_compar_r_t<TYPE> = ::std::option::Option<
    unsafe extern "C" fn(
        lhs: *const TYPE,
        rhs: *const TYPE,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type android_Vector_iterator<TYPE> = *mut TYPE;
pub type android_Vector_const_iterator<TYPE> = *const TYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_IResultReceiver {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_IShellCallback {
    _unused: [u8; 0],
}
#[doc = " Base class and low-level protocol for a remotable object."]
#[doc = " You can derive from this class to create an object for which other"]
#[doc = " processes can hold references to it.  Communication between processes"]
#[doc = " (method calls, property get and set) is down through a low-level"]
#[doc = " protocol implemented on top of the transact() API."]
#[repr(C)]
pub struct android_IBinder {
    pub __bindgen_padding_0: [u64; 3usize],
}
pub const android_IBinder_FIRST_CALL_TRANSACTION: android_IBinder__bindgen_ty_1 = 1;
pub const android_IBinder_LAST_CALL_TRANSACTION: android_IBinder__bindgen_ty_1 = 16777215;
pub const android_IBinder_PING_TRANSACTION: android_IBinder__bindgen_ty_1 = 1599098439;
pub const android_IBinder_DUMP_TRANSACTION: android_IBinder__bindgen_ty_1 = 1598311760;
pub const android_IBinder_SHELL_COMMAND_TRANSACTION: android_IBinder__bindgen_ty_1 = 1598246212;
pub const android_IBinder_INTERFACE_TRANSACTION: android_IBinder__bindgen_ty_1 = 1598968902;
pub const android_IBinder_SYSPROPS_TRANSACTION: android_IBinder__bindgen_ty_1 = 1599295570;
pub const android_IBinder_EXTENSION_TRANSACTION: android_IBinder__bindgen_ty_1 = 1598380116;
pub const android_IBinder_DEBUG_PID_TRANSACTION: android_IBinder__bindgen_ty_1 = 1599097156;
pub const android_IBinder_FLAG_ONEWAY: android_IBinder__bindgen_ty_1 = 1;
pub const android_IBinder_FLAG_PRIVATE_VENDOR: android_IBinder__bindgen_ty_1 = 268435456;
pub type android_IBinder__bindgen_ty_1 = u32;
#[repr(C)]
pub struct android_IBinder_DeathRecipient {
    pub __bindgen_padding_0: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_android_IBinder_DeathRecipient() {
    assert_eq!(
        ::std::mem::size_of::<android_IBinder_DeathRecipient>(),
        24usize,
        concat!("Size of: ", stringify!(android_IBinder_DeathRecipient))
    );
    assert_eq!(
        ::std::mem::align_of::<android_IBinder_DeathRecipient>(),
        8usize,
        concat!("Alignment of ", stringify!(android_IBinder_DeathRecipient))
    );
}
pub type android_IBinder_object_cleanup_func = ::std::option::Option<
    unsafe extern "C" fn(
        id: *const ::std::os::raw::c_void,
        obj: *mut ::std::os::raw::c_void,
        cleanupCookie: *mut ::std::os::raw::c_void,
    ),
>;
#[test]
fn bindgen_test_layout_android_IBinder() {
    assert_eq!(
        ::std::mem::size_of::<android_IBinder>(),
        24usize,
        concat!("Size of: ", stringify!(android_IBinder))
    );
    assert_eq!(
        ::std::mem::align_of::<android_IBinder>(),
        8usize,
        concat!("Alignment of ", stringify!(android_IBinder))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7IBinder12shellCommandERKNS_2spIS0_EEiiiRNS_6VectorINS_8String16EEERKNS1_INS_14IShellCallbackEEERKNS1_INS_15IResultReceiverEEE"]
    pub fn android_IBinder_shellCommand(
        target: *const android_sp<android_IBinder>,
        in_: ::std::os::raw::c_int,
        out: ::std::os::raw::c_int,
        err: ::std::os::raw::c_int,
        args: *mut android_Vector,
        callback: *const android_sp<android_IShellCallback>,
        resultReceiver: *const android_sp<android_IResultReceiver>,
    ) -> android_status_t;
}
extern "C" {
    #[doc = " This allows someone to add their own additions to an interface without"]
    #[doc = " having to modify the original interface."]
    #[doc = ""]
    #[doc = " For instance, imagine if we have this interface:"]
    #[doc = "     interface IFoo { void doFoo(); }"]
    #[doc = ""]
    #[doc = " If an unrelated owner (perhaps in a downstream codebase) wants to make a"]
    #[doc = " change to the interface, they have two options:"]
    #[doc = ""]
    #[doc = " A). Historical option that has proven to be BAD! Only the original"]
    #[doc = "     author of an interface should change an interface. If someone"]
    #[doc = "     downstream wants additional functionality, they should not ever"]
    #[doc = "     change the interface or use this method."]
    #[doc = ""]
    #[doc = "    BAD TO DO:  interface IFoo {                       BAD TO DO"]
    #[doc = "    BAD TO DO:      void doFoo();                      BAD TO DO"]
    #[doc = "    BAD TO DO: +    void doBar(); // adding a method   BAD TO DO"]
    #[doc = "    BAD TO DO:  }                                      BAD TO DO"]
    #[doc = ""]
    #[doc = " B). Option that this method enables!"]
    #[doc = "     Leave the original interface unchanged (do not change IFoo!)."]
    #[doc = "     Instead, create a new interface in a downstream package:"]
    #[doc = ""]
    #[doc = "         package com.<name>; // new functionality in a new package"]
    #[doc = "         interface IBar { void doBar(); }"]
    #[doc = ""]
    #[doc = "     When registering the interface, add:"]
    #[doc = "         sp<MyFoo> foo = new MyFoo; // class in AOSP codebase"]
    #[doc = "         sp<MyBar> bar = new MyBar; // custom extension class"]
    #[doc = "         foo->setExtension(bar);    // use method in BBinder"]
    #[doc = ""]
    #[doc = "     Then, clients of IFoo can get this extension:"]
    #[doc = "         sp<IBinder> binder = ...;"]
    #[doc = "         sp<IFoo> foo = interface_cast<IFoo>(binder); // handle if null"]
    #[doc = "         sp<IBinder> barBinder;"]
    #[doc = "         ... handle error ... = binder->getExtension(&barBinder);"]
    #[doc = "         sp<IBar> bar = interface_cast<IBar>(barBinder);"]
    #[doc = "         // if bar is null, then there is no extension or a different"]
    #[doc = "         // type of extension"]
    #[link_name = "\u{1}_ZN7android7IBinder12getExtensionEPNS_2spIS0_EE"]
    pub fn android_IBinder_getExtension(
        this: *mut android_IBinder,
        out: *mut android_sp<android_IBinder>,
    ) -> android_status_t;
}
extern "C" {
    #[doc = " Dump PID for a binder, for debugging."]
    #[link_name = "\u{1}_ZN7android7IBinder11getDebugPidEPi"]
    pub fn android_IBinder_getDebugPid(
        this: *mut android_IBinder,
        outPid: *mut pid_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7IBinderC2Ev"]
    pub fn android_IBinder_IBinder(this: *mut android_IBinder);
}
impl android_IBinder {
    #[inline]
    pub unsafe fn shellCommand(
        target: *const android_sp<android_IBinder>,
        in_: ::std::os::raw::c_int,
        out: ::std::os::raw::c_int,
        err: ::std::os::raw::c_int,
        args: *mut android_Vector,
        callback: *const android_sp<android_IShellCallback>,
        resultReceiver: *const android_sp<android_IResultReceiver>,
    ) -> android_status_t {
        android_IBinder_shellCommand(target, in_, out, err, args, callback, resultReceiver)
    }
    #[inline]
    pub unsafe fn getExtension(
        &mut self,
        out: *mut android_sp<android_IBinder>,
    ) -> android_status_t {
        android_IBinder_getExtension(self, out)
    }
    #[inline]
    pub unsafe fn getDebugPid(&mut self, outPid: *mut pid_t) -> android_status_t {
        android_IBinder_getDebugPid(self, outPid)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_IBinder_IBinder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[doc = " Check if this IBinder implements the interface named by"]
    #[doc = " @a descriptor.  If it does, the base pointer to it is returned,"]
    #[doc = " which you can safely static_cast<> to the concrete C++ interface."]
    #[link_name = "\u{1}_ZN7android7IBinder19queryLocalInterfaceERKNS_8String16E"]
    pub fn android_IBinder_queryLocalInterface(
        this: *mut ::std::os::raw::c_void,
        descriptor: *const android_String16,
    ) -> android_sp<android_IInterface>;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7IBinder13checkSubclassEPKv"]
    pub fn android_IBinder_checkSubclass(
        this: *mut ::std::os::raw::c_void,
        subclassID: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7IBinder11localBinderEv"]
    pub fn android_IBinder_localBinder(this: *mut ::std::os::raw::c_void) -> *mut android_BBinder;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7IBinder12remoteBinderEv"]
    pub fn android_IBinder_remoteBinder(this: *mut ::std::os::raw::c_void)
        -> *mut android_BpBinder;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7IBinderD1Ev"]
    pub fn android_IBinder_IBinder_destructor(this: *mut android_IBinder);
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub struct android_BBinder {
    pub _bindgen_opaque_blob: [u64; 5usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_BBinder_Extras {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union android_BBinder__bindgen_ty_1 {
    pub mStability: i32,
    pub mReserved0: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_android_BBinder__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<android_BBinder__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(android_BBinder__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<android_BBinder__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(android_BBinder__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BBinder__bindgen_ty_1>())).mStability as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BBinder__bindgen_ty_1),
            "::",
            stringify!(mStability)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BBinder__bindgen_ty_1>())).mReserved0 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BBinder__bindgen_ty_1),
            "::",
            stringify!(mReserved0)
        )
    );
}
#[test]
fn bindgen_test_layout_android_BBinder() {
    assert_eq!(
        ::std::mem::size_of::<android_BBinder>(),
        40usize,
        concat!("Size of: ", stringify!(android_BBinder))
    );
    assert_eq!(
        ::std::mem::align_of::<android_BBinder>(),
        8usize,
        concat!("Alignment of ", stringify!(android_BBinder))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder15isRequestingSidEv"]
    pub fn android_BBinder_isRequestingSid(this: *mut android_BBinder) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder16setRequestingSidEb"]
    pub fn android_BBinder_setRequestingSid(this: *mut android_BBinder, requestSid: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder12getExtensionEv"]
    pub fn android_BBinder_getExtension(this: *mut android_BBinder) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder12setExtensionERKNS_2spINS_7IBinderEEE"]
    pub fn android_BBinder_setExtension(
        this: *mut android_BBinder,
        extension: *const android_sp<android_IBinder>,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder11getDebugPidEv"]
    pub fn android_BBinder_getDebugPid(this: *mut android_BBinder) -> pid_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinderC1Ev"]
    pub fn android_BBinder_BBinder(this: *mut android_BBinder);
}
impl android_BBinder {
    #[inline]
    pub unsafe fn isRequestingSid(&mut self) -> bool {
        android_BBinder_isRequestingSid(self)
    }
    #[inline]
    pub unsafe fn setRequestingSid(&mut self, requestSid: bool) {
        android_BBinder_setRequestingSid(self, requestSid)
    }
    #[inline]
    pub unsafe fn getExtension(&mut self) -> android_sp<android_IBinder> {
        android_BBinder_getExtension(self)
    }
    #[inline]
    pub unsafe fn setExtension(&mut self, extension: *const android_sp<android_IBinder>) {
        android_BBinder_setExtension(self, extension)
    }
    #[inline]
    pub unsafe fn getDebugPid(&mut self) -> pid_t {
        android_BBinder_getDebugPid(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_BBinder_BBinder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7BBinder22getInterfaceDescriptorEv"]
    pub fn android_BBinder_getInterfaceDescriptor(
        this: *mut ::std::os::raw::c_void,
    ) -> *const android_String16;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7BBinder13isBinderAliveEv"]
    pub fn android_BBinder_isBinderAlive(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder10pingBinderEv"]
    pub fn android_BBinder_pingBinder(this: *mut ::std::os::raw::c_void) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder4dumpEiRKNS_6VectorINS_8String16EEE"]
    pub fn android_BBinder_dump(
        this: *mut ::std::os::raw::c_void,
        fd: ::std::os::raw::c_int,
        args: *const android_Vector,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder8transactEjRKNS_6ParcelEPS1_j"]
    pub fn android_BBinder_transact(
        this: *mut ::std::os::raw::c_void,
        code: u32,
        data: *const android_Parcel,
        reply: *mut android_Parcel,
        flags: u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"]
    pub fn android_BBinder_linkToDeath(
        this: *mut ::std::os::raw::c_void,
        recipient: *const android_sp<android_IBinder_DeathRecipient>,
        cookie: *mut ::std::os::raw::c_void,
        flags: u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"]
    pub fn android_BBinder_unlinkToDeath(
        this: *mut ::std::os::raw::c_void,
        recipient: *const android_wp<android_IBinder_DeathRecipient>,
        cookie: *mut ::std::os::raw::c_void,
        flags: u32,
        outRecipient: *mut android_wp<android_IBinder_DeathRecipient>,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"]
    pub fn android_BBinder_attachObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
        object: *mut ::std::os::raw::c_void,
        cleanupCookie: *mut ::std::os::raw::c_void,
        func: android_IBinder_object_cleanup_func,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android7BBinder10findObjectEPKv"]
    pub fn android_BBinder_findObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder12detachObjectEPKv"]
    pub fn android_BBinder_detachObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder11localBinderEv"]
    pub fn android_BBinder_localBinder(this: *mut ::std::os::raw::c_void) -> *mut android_BBinder;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinderD1Ev"]
    pub fn android_BBinder_BBinder_destructor(this: *mut android_BBinder);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android7BBinder10onTransactEjRKNS_6ParcelEPS1_j"]
    pub fn android_BBinder_onTransact(
        this: *mut ::std::os::raw::c_void,
        code: u32,
        data: *const android_Parcel,
        reply: *mut android_Parcel,
        flags: u32,
    ) -> android_status_t;
}
#[repr(C)]
pub struct android_SortedVector {
    pub _base: android_SortedVectorImpl,
}
pub type android_SortedVector_value_type<TYPE> = TYPE;
pub type android_SortedVector_iterator<TYPE> = *mut TYPE;
pub type android_SortedVector_const_iterator<TYPE> = *const TYPE;
#[repr(C)]
pub struct android_KeyedVector {
    pub mVector: android_SortedVector,
}
pub type android_KeyedVector_key_type<KEY> = KEY;
pub type android_KeyedVector_value_type<VALUE> = VALUE;
#[repr(C)]
pub struct android_Mutex {
    pub mMutex: pthread_mutex_t,
}
pub const android_Mutex_PRIVATE: android_Mutex__bindgen_ty_1 = 0;
pub const android_Mutex_SHARED: android_Mutex__bindgen_ty_1 = 1;
pub type android_Mutex__bindgen_ty_1 = u32;
#[repr(C)]
pub struct android_Mutex_Autolock {
    pub mLock: *mut android_Mutex,
}
#[test]
fn bindgen_test_layout_android_Mutex_Autolock() {
    assert_eq!(
        ::std::mem::size_of::<android_Mutex_Autolock>(),
        8usize,
        concat!("Size of: ", stringify!(android_Mutex_Autolock))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Mutex_Autolock>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Mutex_Autolock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Mutex_Autolock>())).mLock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Mutex_Autolock),
            "::",
            stringify!(mLock)
        )
    );
}
#[test]
fn bindgen_test_layout_android_Mutex() {
    assert_eq!(
        ::std::mem::size_of::<android_Mutex>(),
        40usize,
        concat!("Size of: ", stringify!(android_Mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Mutex>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Mutex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Mutex>())).mMutex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Mutex),
            "::",
            stringify!(mMutex)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5Mutex4lockEv"]
    pub fn android_Mutex_lock(this: *mut android_Mutex) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5Mutex6unlockEv"]
    pub fn android_Mutex_unlock(this: *mut android_Mutex);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5Mutex7tryLockEv"]
    pub fn android_Mutex_tryLock(this: *mut android_Mutex) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5MutexC1Ev"]
    pub fn android_Mutex_Mutex(this: *mut android_Mutex);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5MutexC1EPKc"]
    pub fn android_Mutex_Mutex1(this: *mut android_Mutex, name: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5MutexC1EiPKc"]
    pub fn android_Mutex_Mutex2(
        this: *mut android_Mutex,
        type_: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android5MutexD1Ev"]
    pub fn android_Mutex_Mutex_destructor(this: *mut android_Mutex);
}
impl android_Mutex {
    #[inline]
    pub unsafe fn lock(&mut self) -> android_status_t {
        android_Mutex_lock(self)
    }
    #[inline]
    pub unsafe fn unlock(&mut self) {
        android_Mutex_unlock(self)
    }
    #[inline]
    pub unsafe fn tryLock(&mut self) -> android_status_t {
        android_Mutex_tryLock(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Mutex_Mutex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(name: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Mutex_Mutex1(__bindgen_tmp.as_mut_ptr(), name);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(type_: ::std::os::raw::c_int, name: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Mutex_Mutex2(__bindgen_tmp.as_mut_ptr(), type_, name);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_Mutex_Mutex_destructor(self)
    }
}
pub type android_thread_id_t = u64;
#[repr(C)]
pub struct android_Condition {
    pub mCond: pthread_cond_t,
}
pub const android_Condition_PRIVATE: android_Condition__bindgen_ty_1 = 0;
pub const android_Condition_SHARED: android_Condition__bindgen_ty_1 = 1;
pub type android_Condition__bindgen_ty_1 = u32;
pub const android_Condition_WakeUpType_WAKE_UP_ONE: android_Condition_WakeUpType = 0;
pub const android_Condition_WakeUpType_WAKE_UP_ALL: android_Condition_WakeUpType = 1;
pub type android_Condition_WakeUpType = u32;
#[test]
fn bindgen_test_layout_android_Condition() {
    assert_eq!(
        ::std::mem::size_of::<android_Condition>(),
        48usize,
        concat!("Size of: ", stringify!(android_Condition))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Condition>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Condition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Condition>())).mCond as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Condition),
            "::",
            stringify!(mCond)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9Condition4waitERNS_5MutexE"]
    pub fn android_Condition_wait(
        this: *mut android_Condition,
        mutex: *mut android_Mutex,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9Condition12waitRelativeERNS_5MutexEl"]
    pub fn android_Condition_waitRelative(
        this: *mut android_Condition,
        mutex: *mut android_Mutex,
        reltime: nsecs_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9Condition6signalEv"]
    pub fn android_Condition_signal(this: *mut android_Condition);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9Condition9broadcastEv"]
    pub fn android_Condition_broadcast(this: *mut android_Condition);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9ConditionC1Ev"]
    pub fn android_Condition_Condition(this: *mut android_Condition);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9ConditionC1Ei"]
    pub fn android_Condition_Condition1(this: *mut android_Condition, type_: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android9ConditionD1Ev"]
    pub fn android_Condition_Condition_destructor(this: *mut android_Condition);
}
impl android_Condition {
    #[inline]
    pub unsafe fn wait(&mut self, mutex: *mut android_Mutex) -> android_status_t {
        android_Condition_wait(self, mutex)
    }
    #[inline]
    pub unsafe fn waitRelative(
        &mut self,
        mutex: *mut android_Mutex,
        reltime: nsecs_t,
    ) -> android_status_t {
        android_Condition_waitRelative(self, mutex, reltime)
    }
    #[inline]
    pub unsafe fn signal(&mut self) {
        android_Condition_signal(self)
    }
    #[inline]
    pub unsafe fn broadcast(&mut self) {
        android_Condition_broadcast(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Condition_Condition(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(type_: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Condition_Condition1(__bindgen_tmp.as_mut_ptr(), type_);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_Condition_Condition_destructor(self)
    }
}
#[repr(C)]
pub struct android_Thread {
    pub __bindgen_padding_0: [u8; 8usize],
    pub mCanCallJava: bool,
    pub mThread: android_thread_id_t,
    pub mLock: android_Mutex,
    pub mThreadExitedCondition: android_Condition,
    pub mStatus: android_status_t,
    pub mExitPending: bool,
    pub mRunning: bool,
    pub mHoldSelf: android_sp<android_Thread>,
    pub __bindgen_padding_1: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_android_Thread() {
    assert_eq!(
        ::std::mem::size_of::<android_Thread>(),
        144usize,
        concat!("Size of: ", stringify!(android_Thread))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Thread>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Thread))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mCanCallJava as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mCanCallJava)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mThread as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mThread)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mLock as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mLock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_Thread>())).mThreadExitedCondition as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mThreadExitedCondition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mStatus as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mExitPending as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mExitPending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mRunning as *const _ as usize },
        117usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mRunning)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Thread>())).mHoldSelf as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Thread),
            "::",
            stringify!(mHoldSelf)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Thread18requestExitAndWaitEv"]
    pub fn android_Thread_requestExitAndWait(this: *mut android_Thread) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Thread4joinEv"]
    pub fn android_Thread_join(this: *mut android_Thread) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Thread9isRunningEv"]
    pub fn android_Thread_isRunning(this: *const android_Thread) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Thread11exitPendingEv"]
    pub fn android_Thread_exitPending(this: *const android_Thread) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6ThreadC2Eb"]
    pub fn android_Thread_Thread(this: *mut android_Thread, canCallJava: bool);
}
impl android_Thread {
    #[inline]
    pub unsafe fn requestExitAndWait(&mut self) -> android_status_t {
        android_Thread_requestExitAndWait(self)
    }
    #[inline]
    pub unsafe fn join(&mut self) -> android_status_t {
        android_Thread_join(self)
    }
    #[inline]
    pub unsafe fn isRunning(&self) -> bool {
        android_Thread_isRunning(self)
    }
    #[inline]
    pub unsafe fn exitPending(&self) -> bool {
        android_Thread_exitPending(self)
    }
    #[inline]
    pub unsafe fn new(canCallJava: bool) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Thread_Thread(__bindgen_tmp.as_mut_ptr(), canCallJava);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6ThreadD1Ev"]
    pub fn android_Thread_Thread_destructor(this: *mut android_Thread);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Thread3runEPKcim"]
    pub fn android_Thread_run(
        this: *mut ::std::os::raw::c_void,
        name: *const ::std::os::raw::c_char,
        priority: i32,
        stack: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Thread11requestExitEv"]
    pub fn android_Thread_requestExit(this: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Thread10readyToRunEv"]
    pub fn android_Thread_readyToRun(this: *mut ::std::os::raw::c_void) -> android_status_t;
}
pub type android_binder_proxy_limit_callback =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub struct android_BpBinder {
    pub _bindgen_opaque_blob: [u64; 18usize],
}
#[repr(C)]
pub struct android_BpBinder_ObjectManager {
    pub mObjects: android_KeyedVector,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_BpBinder_ObjectManager_entry_t {
    pub object: *mut ::std::os::raw::c_void,
    pub cleanupCookie: *mut ::std::os::raw::c_void,
    pub func: android_IBinder_object_cleanup_func,
}
#[test]
fn bindgen_test_layout_android_BpBinder_ObjectManager_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<android_BpBinder_ObjectManager_entry_t>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(android_BpBinder_ObjectManager_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<android_BpBinder_ObjectManager_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(android_BpBinder_ObjectManager_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_ObjectManager_entry_t>())).object as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_ObjectManager_entry_t),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_ObjectManager_entry_t>())).cleanupCookie
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_ObjectManager_entry_t),
            "::",
            stringify!(cleanupCookie)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_ObjectManager_entry_t>())).func as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_ObjectManager_entry_t),
            "::",
            stringify!(func)
        )
    );
}
#[test]
fn bindgen_test_layout_android_BpBinder_ObjectManager() {
    assert_eq!(
        ::std::mem::size_of::<android_BpBinder_ObjectManager>(),
        40usize,
        concat!("Size of: ", stringify!(android_BpBinder_ObjectManager))
    );
    assert_eq!(
        ::std::mem::align_of::<android_BpBinder_ObjectManager>(),
        8usize,
        concat!("Alignment of ", stringify!(android_BpBinder_ObjectManager))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_ObjectManager>())).mObjects as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_ObjectManager),
            "::",
            stringify!(mObjects)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13ObjectManager6attachEPKvPvS4_PFvS3_S4_S4_E"]
    pub fn android_BpBinder_ObjectManager_attach(
        this: *mut android_BpBinder_ObjectManager,
        objectID: *const ::std::os::raw::c_void,
        object: *mut ::std::os::raw::c_void,
        cleanupCookie: *mut ::std::os::raw::c_void,
        func: android_IBinder_object_cleanup_func,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8BpBinder13ObjectManager4findEPKv"]
    pub fn android_BpBinder_ObjectManager_find(
        this: *const android_BpBinder_ObjectManager,
        objectID: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13ObjectManager6detachEPKv"]
    pub fn android_BpBinder_ObjectManager_detach(
        this: *mut android_BpBinder_ObjectManager,
        objectID: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13ObjectManager4killEv"]
    pub fn android_BpBinder_ObjectManager_kill(this: *mut android_BpBinder_ObjectManager);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13ObjectManagerC1Ev"]
    pub fn android_BpBinder_ObjectManager_ObjectManager(this: *mut android_BpBinder_ObjectManager);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13ObjectManagerD1Ev"]
    pub fn android_BpBinder_ObjectManager_ObjectManager_destructor(
        this: *mut android_BpBinder_ObjectManager,
    );
}
impl android_BpBinder_ObjectManager {
    #[inline]
    pub unsafe fn attach(
        &mut self,
        objectID: *const ::std::os::raw::c_void,
        object: *mut ::std::os::raw::c_void,
        cleanupCookie: *mut ::std::os::raw::c_void,
        func: android_IBinder_object_cleanup_func,
    ) {
        android_BpBinder_ObjectManager_attach(self, objectID, object, cleanupCookie, func)
    }
    #[inline]
    pub unsafe fn find(
        &self,
        objectID: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void {
        android_BpBinder_ObjectManager_find(self, objectID)
    }
    #[inline]
    pub unsafe fn detach(&mut self, objectID: *const ::std::os::raw::c_void) {
        android_BpBinder_ObjectManager_detach(self, objectID)
    }
    #[inline]
    pub unsafe fn kill(&mut self) {
        android_BpBinder_ObjectManager_kill(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_BpBinder_ObjectManager_ObjectManager(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_BpBinder_ObjectManager_ObjectManager_destructor(self)
    }
}
#[repr(C)]
pub struct android_BpBinder_Obituary {
    pub recipient: android_wp<android_IBinder_DeathRecipient>,
    pub cookie: *mut ::std::os::raw::c_void,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_android_BpBinder_Obituary() {
    assert_eq!(
        ::std::mem::size_of::<android_BpBinder_Obituary>(),
        32usize,
        concat!("Size of: ", stringify!(android_BpBinder_Obituary))
    );
    assert_eq!(
        ::std::mem::align_of::<android_BpBinder_Obituary>(),
        8usize,
        concat!("Alignment of ", stringify!(android_BpBinder_Obituary))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_Obituary>())).recipient as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_Obituary),
            "::",
            stringify!(recipient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_BpBinder_Obituary>())).cookie as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_Obituary),
            "::",
            stringify!(cookie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_BpBinder_Obituary>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_BpBinder_Obituary),
            "::",
            stringify!(flags)
        )
    );
}
#[test]
fn bindgen_test_layout_android_BpBinder() {
    assert_eq!(
        ::std::mem::size_of::<android_BpBinder>(),
        144usize,
        concat!("Size of: ", stringify!(android_BpBinder))
    );
    assert_eq!(
        ::std::mem::align_of::<android_BpBinder>(),
        8usize,
        concat!("Alignment of ", stringify!(android_BpBinder))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder6createEi"]
    pub fn android_BpBinder_create(handle: i32) -> *mut android_BpBinder;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8BpBinder6handleEv"]
    pub fn android_BpBinder_handle(this: *const android_BpBinder) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder12sendObituaryEv"]
    pub fn android_BpBinder_sendObituary(this: *mut android_BpBinder);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder19getBinderProxyCountEj"]
    pub fn android_BpBinder_getBinderProxyCount(uid: u32) -> u32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13getCountByUidERNS_6VectorIjEES3_"]
    pub fn android_BpBinder_getCountByUid(uids: *mut android_Vector, counts: *mut android_Vector);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder16enableCountByUidEv"]
    pub fn android_BpBinder_enableCountByUid();
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder17disableCountByUidEv"]
    pub fn android_BpBinder_disableCountByUid();
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder20setCountByUidEnabledEb"]
    pub fn android_BpBinder_setCountByUidEnabled(enable: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder16setLimitCallbackEPFviE"]
    pub fn android_BpBinder_setLimitCallback(cb: android_binder_proxy_limit_callback);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder29setBinderProxyCountWatermarksEii"]
    pub fn android_BpBinder_setBinderProxyCountWatermarks(
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinderC1Eii"]
    pub fn android_BpBinder_BpBinder(this: *mut android_BpBinder, handle: i32, trackedUid: i32);
}
impl android_BpBinder {
    #[inline]
    pub unsafe fn create(handle: i32) -> *mut android_BpBinder {
        android_BpBinder_create(handle)
    }
    #[inline]
    pub unsafe fn handle(&self) -> i32 {
        android_BpBinder_handle(self)
    }
    #[inline]
    pub unsafe fn sendObituary(&mut self) {
        android_BpBinder_sendObituary(self)
    }
    #[inline]
    pub unsafe fn getBinderProxyCount(uid: u32) -> u32 {
        android_BpBinder_getBinderProxyCount(uid)
    }
    #[inline]
    pub unsafe fn getCountByUid(uids: *mut android_Vector, counts: *mut android_Vector) {
        android_BpBinder_getCountByUid(uids, counts)
    }
    #[inline]
    pub unsafe fn enableCountByUid() {
        android_BpBinder_enableCountByUid()
    }
    #[inline]
    pub unsafe fn disableCountByUid() {
        android_BpBinder_disableCountByUid()
    }
    #[inline]
    pub unsafe fn setCountByUidEnabled(enable: bool) {
        android_BpBinder_setCountByUidEnabled(enable)
    }
    #[inline]
    pub unsafe fn setLimitCallback(cb: android_binder_proxy_limit_callback) {
        android_BpBinder_setLimitCallback(cb)
    }
    #[inline]
    pub unsafe fn setBinderProxyCountWatermarks(
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
    ) {
        android_BpBinder_setBinderProxyCountWatermarks(high, low)
    }
    #[inline]
    pub unsafe fn new(handle: i32, trackedUid: i32) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_BpBinder_BpBinder(__bindgen_tmp.as_mut_ptr(), handle, trackedUid);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8BpBinder22getInterfaceDescriptorEv"]
    pub fn android_BpBinder_getInterfaceDescriptor(
        this: *mut ::std::os::raw::c_void,
    ) -> *const android_String16;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8BpBinder13isBinderAliveEv"]
    pub fn android_BpBinder_isBinderAlive(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder10pingBinderEv"]
    pub fn android_BpBinder_pingBinder(this: *mut ::std::os::raw::c_void) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder4dumpEiRKNS_6VectorINS_8String16EEE"]
    pub fn android_BpBinder_dump(
        this: *mut ::std::os::raw::c_void,
        fd: ::std::os::raw::c_int,
        args: *const android_Vector,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder8transactEjRKNS_6ParcelEPS1_j"]
    pub fn android_BpBinder_transact(
        this: *mut ::std::os::raw::c_void,
        code: u32,
        data: *const android_Parcel,
        reply: *mut android_Parcel,
        flags: u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder11linkToDeathERKNS_2spINS_7IBinder14DeathRecipientEEEPvj"]
    pub fn android_BpBinder_linkToDeath(
        this: *mut ::std::os::raw::c_void,
        recipient: *const android_sp<android_IBinder_DeathRecipient>,
        cookie: *mut ::std::os::raw::c_void,
        flags: u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13unlinkToDeathERKNS_2wpINS_7IBinder14DeathRecipientEEEPvjPS4_"]
    pub fn android_BpBinder_unlinkToDeath(
        this: *mut ::std::os::raw::c_void,
        recipient: *const android_wp<android_IBinder_DeathRecipient>,
        cookie: *mut ::std::os::raw::c_void,
        flags: u32,
        outRecipient: *mut android_wp<android_IBinder_DeathRecipient>,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder12attachObjectEPKvPvS3_PFvS2_S3_S3_E"]
    pub fn android_BpBinder_attachObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
        object: *mut ::std::os::raw::c_void,
        cleanupCookie: *mut ::std::os::raw::c_void,
        func: android_IBinder_object_cleanup_func,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android8BpBinder10findObjectEPKv"]
    pub fn android_BpBinder_findObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder12detachObjectEPKv"]
    pub fn android_BpBinder_detachObject(
        this: *mut ::std::os::raw::c_void,
        objectID: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder12remoteBinderEv"]
    pub fn android_BpBinder_remoteBinder(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut android_BpBinder;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinderD1Ev"]
    pub fn android_BpBinder_BpBinder_destructor(this: *mut android_BpBinder);
}
extern "C" {
    #[link_name = "\u{1}_ZTv0_n32_N7android8BpBinder10onFirstRefEv"]
    pub fn android_BpBinder_onFirstRef(this: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}_ZTv0_n40_N7android8BpBinder15onLastStrongRefEPKv"]
    pub fn android_BpBinder_onLastStrongRef(
        this: *mut ::std::os::raw::c_void,
        id: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZTv0_n48_N7android8BpBinder20onIncStrongAttemptedEjPKv"]
    pub fn android_BpBinder_onIncStrongAttempted(
        this: *mut ::std::os::raw::c_void,
        flags: u32,
        id: *const ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder13sTrackingLockE"]
    pub static mut android_BpBinder_sTrackingLock: android_Mutex;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder12sTrackingMapE"]
    pub static mut android_BpBinder_sTrackingMap: u8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder15sNumTrackedUidsE"]
    pub static mut android_BpBinder_sNumTrackedUids: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder18sCountByUidEnabledE"]
    pub static mut android_BpBinder_sCountByUidEnabled: std_atomic_bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder14sLimitCallbackE"]
    pub static mut android_BpBinder_sLimitCallback: android_binder_proxy_limit_callback;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder30sBinderProxyCountHighWatermarkE"]
    pub static mut android_BpBinder_sBinderProxyCountHighWatermark: u32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder29sBinderProxyCountLowWatermarkE"]
    pub static mut android_BpBinder_sBinderProxyCountLowWatermark: u32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android8BpBinder26sBinderProxyThrottleCreateE"]
    pub static mut android_BpBinder_sBinderProxyThrottleCreate: bool;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_base_DefaultCloser {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_android_base_DefaultCloser() {
    assert_eq!(
        ::std::mem::size_of::<android_base_DefaultCloser>(),
        1usize,
        concat!("Size of: ", stringify!(android_base_DefaultCloser))
    );
    assert_eq!(
        ::std::mem::align_of::<android_base_DefaultCloser>(),
        1usize,
        concat!("Alignment of ", stringify!(android_base_DefaultCloser))
    );
}
#[repr(C)]
pub struct android_base_unique_fd_impl {
    pub fd_: ::std::os::raw::c_int,
}
pub type android_base_unique_fd = android_base_unique_fd_impl;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_Flattenable {
    pub _address: u8,
}
#[repr(C)]
pub struct android_IInterface {
    pub __bindgen_padding_0: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_android_IInterface() {
    assert_eq!(
        ::std::mem::size_of::<android_IInterface>(),
        24usize,
        concat!("Size of: ", stringify!(android_IInterface))
    );
    assert_eq!(
        ::std::mem::align_of::<android_IInterface>(),
        8usize,
        concat!("Alignment of ", stringify!(android_IInterface))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10IInterface8asBinderEPKS0_"]
    pub fn android_IInterface_asBinder(
        arg1: *const android_IInterface,
    ) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10IInterface8asBinderERKNS_2spIS0_EE"]
    pub fn android_IInterface_asBinder1(
        arg1: *const android_sp<android_IInterface>,
    ) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10IInterfaceC2Ev"]
    pub fn android_IInterface_IInterface(this: *mut android_IInterface);
}
impl android_IInterface {
    #[inline]
    pub unsafe fn asBinder(arg1: *const android_IInterface) -> android_sp<android_IBinder> {
        android_IInterface_asBinder(arg1)
    }
    #[inline]
    pub unsafe fn asBinder1(
        arg1: *const android_sp<android_IInterface>,
    ) -> android_sp<android_IBinder> {
        android_IInterface_asBinder1(arg1)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_IInterface_IInterface(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN7android10IInterfaceD1Ev"]
    pub fn android_IInterface_IInterface_destructor(this: *mut android_IInterface);
}
#[repr(C)]
pub struct android_Parcelable__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
pub struct android_Parcelable {
    pub vtable_: *const android_Parcelable__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_android_Parcelable() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcelable>(),
        8usize,
        concat!("Size of: ", stringify!(android_Parcelable))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcelable>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Parcelable))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_flat_binder_object {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_TextOutput {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct android_Parcel {
    pub mError: android_status_t,
    pub mData: *mut u8,
    pub mDataSize: size_t,
    pub mDataCapacity: size_t,
    pub mDataPos: size_t,
    pub mObjects: *mut binder_size_t,
    pub mObjectsSize: size_t,
    pub mObjectsCapacity: size_t,
    pub mNextObjectHint: size_t,
    pub mObjectsSorted: bool,
    pub mRequestHeaderPresent: bool,
    pub mWorkSourceRequestHeaderPosition: size_t,
    pub mFdsKnown: bool,
    pub mHasFds: bool,
    pub mAllowFds: bool,
    pub mOwner: android_Parcel_release_func,
    pub mOwnerCookie: *mut ::std::os::raw::c_void,
    pub mOpenAshmemSize: size_t,
}
pub type android_Parcel_release_func = ::std::option::Option<
    unsafe extern "C" fn(
        parcel: *mut android_Parcel,
        data: *const u8,
        dataSize: size_t,
        objects: *const binder_size_t,
        objectsSize: size_t,
        cookie: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
pub struct android_Parcel_Blob {
    pub mFd: ::std::os::raw::c_int,
    pub mData: *mut ::std::os::raw::c_void,
    pub mSize: size_t,
    pub mMutable: bool,
}
#[test]
fn bindgen_test_layout_android_Parcel_Blob() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcel_Blob>(),
        32usize,
        concat!("Size of: ", stringify!(android_Parcel_Blob))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcel_Blob>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Parcel_Blob))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel_Blob>())).mFd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel_Blob),
            "::",
            stringify!(mFd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel_Blob>())).mData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel_Blob),
            "::",
            stringify!(mData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel_Blob>())).mSize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel_Blob),
            "::",
            stringify!(mSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel_Blob>())).mMutable as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel_Blob),
            "::",
            stringify!(mMutable)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel4Blob5clearEv"]
    pub fn android_Parcel_Blob_clear(this: *mut android_Parcel_Blob);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel4Blob7releaseEv"]
    pub fn android_Parcel_Blob_release(this: *mut android_Parcel_Blob);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel4Blob4initEiPvmb"]
    pub fn android_Parcel_Blob_init(
        this: *mut android_Parcel_Blob,
        fd: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
        size: size_t,
        isMutable: bool,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel4BlobC1Ev"]
    pub fn android_Parcel_Blob_Blob(this: *mut android_Parcel_Blob);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel4BlobD1Ev"]
    pub fn android_Parcel_Blob_Blob_destructor(this: *mut android_Parcel_Blob);
}
impl android_Parcel_Blob {
    #[inline]
    pub unsafe fn clear(&mut self) {
        android_Parcel_Blob_clear(self)
    }
    #[inline]
    pub unsafe fn release(&mut self) {
        android_Parcel_Blob_release(self)
    }
    #[inline]
    pub unsafe fn init(
        &mut self,
        fd: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
        size: size_t,
        isMutable: bool,
    ) {
        android_Parcel_Blob_init(self, fd, data, size, isMutable)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Parcel_Blob_Blob(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_Parcel_Blob_Blob_destructor(self)
    }
}
#[repr(C)]
pub struct android_Parcel_FlattenableHelperInterface__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
pub struct android_Parcel_FlattenableHelperInterface {
    pub vtable_: *const android_Parcel_FlattenableHelperInterface__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_android_Parcel_FlattenableHelperInterface() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcel_FlattenableHelperInterface>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(android_Parcel_FlattenableHelperInterface)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcel_FlattenableHelperInterface>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(android_Parcel_FlattenableHelperInterface)
        )
    );
}
#[repr(C)]
pub struct android_Parcel_FlattenableHelper {
    pub _base: android_Parcel_FlattenableHelperInterface,
    pub val: *const android_Flattenable,
}
#[repr(C)]
pub struct android_Parcel_ReadableBlob {
    pub _base: android_Parcel_Blob,
}
#[test]
fn bindgen_test_layout_android_Parcel_ReadableBlob() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcel_ReadableBlob>(),
        32usize,
        concat!("Size of: ", stringify!(android_Parcel_ReadableBlob))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcel_ReadableBlob>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Parcel_ReadableBlob))
    );
}
#[repr(C)]
pub struct android_Parcel_WritableBlob {
    pub _base: android_Parcel_Blob,
}
#[test]
fn bindgen_test_layout_android_Parcel_WritableBlob() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcel_WritableBlob>(),
        32usize,
        concat!("Size of: ", stringify!(android_Parcel_WritableBlob))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcel_WritableBlob>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Parcel_WritableBlob))
    );
}
#[test]
fn bindgen_test_layout_android_Parcel() {
    assert_eq!(
        ::std::mem::size_of::<android_Parcel>(),
        120usize,
        concat!("Size of: ", stringify!(android_Parcel))
    );
    assert_eq!(
        ::std::mem::align_of::<android_Parcel>(),
        8usize,
        concat!("Alignment of ", stringify!(android_Parcel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mError as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mError)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mDataSize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mDataSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mDataCapacity as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mDataCapacity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mDataPos as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mDataPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mObjects as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mObjects)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mObjectsSize as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mObjectsSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mObjectsCapacity as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mObjectsCapacity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mNextObjectHint as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mNextObjectHint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mObjectsSorted as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mObjectsSorted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_Parcel>())).mRequestHeaderPresent as *const _ as usize
        },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mRequestHeaderPresent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_Parcel>())).mWorkSourceRequestHeaderPosition as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mWorkSourceRequestHeaderPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mFdsKnown as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mFdsKnown)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mHasFds as *const _ as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mHasFds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mAllowFds as *const _ as usize },
        90usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mAllowFds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mOwner as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mOwner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mOwnerCookie as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mOwnerCookie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_Parcel>())).mOpenAshmemSize as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(android_Parcel),
            "::",
            stringify!(mOpenAshmemSize)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel4dataEv"]
    pub fn android_Parcel_data(this: *const android_Parcel) -> *const u8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8dataSizeEv"]
    pub fn android_Parcel_dataSize(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9dataAvailEv"]
    pub fn android_Parcel_dataAvail(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12dataPositionEv"]
    pub fn android_Parcel_dataPosition(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12dataCapacityEv"]
    pub fn android_Parcel_dataCapacity(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11setDataSizeEm"]
    pub fn android_Parcel_setDataSize(this: *mut android_Parcel, size: size_t) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15setDataPositionEm"]
    pub fn android_Parcel_setDataPosition(this: *const android_Parcel, pos: size_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15setDataCapacityEm"]
    pub fn android_Parcel_setDataCapacity(
        this: *mut android_Parcel,
        size: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel7setDataEPKhm"]
    pub fn android_Parcel_setData(
        this: *mut android_Parcel,
        buffer: *const u8,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel10appendFromEPKS0_mm"]
    pub fn android_Parcel_appendFrom(
        this: *mut android_Parcel,
        parcel: *const android_Parcel,
        start: size_t,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11compareDataERKS0_"]
    pub fn android_Parcel_compareData(
        this: *mut android_Parcel,
        other: *const android_Parcel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8allowFdsEv"]
    pub fn android_Parcel_allowFds(this: *const android_Parcel) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel12pushAllowFdsEb"]
    pub fn android_Parcel_pushAllowFds(this: *mut android_Parcel, allowFds: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15restoreAllowFdsEb"]
    pub fn android_Parcel_restoreAllowFds(this: *mut android_Parcel, lastValue: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel18hasFileDescriptorsEv"]
    pub fn android_Parcel_hasFileDescriptors(this: *const android_Parcel) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19writeInterfaceTokenERKNS_8String16E"]
    pub fn android_Parcel_writeInterfaceToken(
        this: *mut android_Parcel,
        interface: *const android_String16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16enforceInterfaceERKNS_8String16EPNS_14IPCThreadStateE"]
    pub fn android_Parcel_enforceInterface(
        this: *const android_Parcel,
        interface: *const android_String16,
        threadState: *mut android_IPCThreadState,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16enforceInterfaceEPKDsmPNS_14IPCThreadStateE"]
    pub fn android_Parcel_enforceInterface1(
        this: *const android_Parcel,
        interface: *const u16,
        len: size_t,
        threadState: *mut android_IPCThreadState,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14checkInterfaceEPNS_7IBinderE"]
    pub fn android_Parcel_checkInterface(
        this: *const android_Parcel,
        arg1: *mut android_IBinder,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel8freeDataEv"]
    pub fn android_Parcel_freeData(this: *mut android_Parcel);
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12objectsCountEv"]
    pub fn android_Parcel_objectsCount(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10errorCheckEv"]
    pub fn android_Parcel_errorCheck(this: *const android_Parcel) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel8setErrorEi"]
    pub fn android_Parcel_setError(this: *mut android_Parcel, err: android_status_t);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel5writeEPKvm"]
    pub fn android_Parcel_write(
        this: *mut android_Parcel,
        data: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel12writeInplaceEm"]
    pub fn android_Parcel_writeInplace(
        this: *mut android_Parcel,
        len: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel13writeUnpaddedEPKvm"]
    pub fn android_Parcel_writeUnpadded(
        this: *mut android_Parcel,
        data: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel10writeInt32Ei"]
    pub fn android_Parcel_writeInt32(this: *mut android_Parcel, val: i32) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11writeUint32Ej"]
    pub fn android_Parcel_writeUint32(this: *mut android_Parcel, val: u32) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel10writeInt64El"]
    pub fn android_Parcel_writeInt64(this: *mut android_Parcel, val: i64) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11writeUint64Em"]
    pub fn android_Parcel_writeUint64(this: *mut android_Parcel, val: u64) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel10writeFloatEf"]
    pub fn android_Parcel_writeFloat(this: *mut android_Parcel, val: f32) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11writeDoubleEd"]
    pub fn android_Parcel_writeDouble(this: *mut android_Parcel, val: f64) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel12writeCStringEPKc"]
    pub fn android_Parcel_writeCString(
        this: *mut android_Parcel,
        str: *const ::std::os::raw::c_char,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel12writeString8ERKNS_7String8E"]
    pub fn android_Parcel_writeString8(
        this: *mut android_Parcel,
        str: *const android_String8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel13writeString16ERKNS_8String16E"]
    pub fn android_Parcel_writeString16(
        this: *mut android_Parcel,
        str: *const android_String16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel13writeString16ERKSt8optionalINS_8String16EE"]
    pub fn android_Parcel_writeString161(
        this: *mut android_Parcel,
        str: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel13writeString16ERKSt10unique_ptrINS_8String16ESt14default_deleteIS2_EE"]
    pub fn android_Parcel_writeString162(
        this: *mut android_Parcel,
        str: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel13writeString16EPKDsm"]
    pub fn android_Parcel_writeString163(
        this: *mut android_Parcel,
        str: *const u16,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeStrongBinderERKNS_2spINS_7IBinderEEE"]
    pub fn android_Parcel_writeStrongBinder(
        this: *mut android_Parcel,
        val: *const android_sp<android_IBinder>,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeInt32ArrayEmPKi"]
    pub fn android_Parcel_writeInt32Array(
        this: *mut android_Parcel,
        len: size_t,
        val: *const i32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel14writeByteArrayEmPKh"]
    pub fn android_Parcel_writeByteArray(
        this: *mut android_Parcel,
        len: size_t,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel9writeBoolEb"]
    pub fn android_Parcel_writeBool(this: *mut android_Parcel, val: bool) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel9writeCharEDs"]
    pub fn android_Parcel_writeChar(this: *mut android_Parcel, val: u16) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel9writeByteEa"]
    pub fn android_Parcel_writeByte(this: *mut android_Parcel, val: i8) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeUtf8AsUtf16ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn android_Parcel_writeUtf8AsUtf16(
        this: *mut android_Parcel,
        str: *const std_string,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeUtf8AsUtf16ERKSt8optionalINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE"]
    pub fn android_Parcel_writeUtf8AsUtf161(
        this: *mut android_Parcel,
        str: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeUtf8AsUtf16ERKSt10unique_ptrINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt14default_deleteIS7_EE"]
    pub fn android_Parcel_writeUtf8AsUtf162(
        this: *mut android_Parcel,
        str: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt8optionalISt6vectorIaSaIaEEE"]
    pub fn android_Parcel_writeByteVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt10unique_ptrISt6vectorIaSaIaEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeByteVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt6vectorIaSaIaEE"]
    pub fn android_Parcel_writeByteVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt8optionalISt6vectorIhSaIhEEE"]
    pub fn android_Parcel_writeByteVector3(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt10unique_ptrISt6vectorIhSaIhEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeByteVector4(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeByteVectorERKSt6vectorIhSaIhEE"]
    pub fn android_Parcel_writeByteVector5(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt32VectorERKSt8optionalISt6vectorIiSaIiEEE"]
    pub fn android_Parcel_writeInt32Vector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt32VectorERKSt10unique_ptrISt6vectorIiSaIiEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeInt32Vector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt32VectorERKSt6vectorIiSaIiEE"]
    pub fn android_Parcel_writeInt32Vector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt64VectorERKSt8optionalISt6vectorIlSaIlEEE"]
    pub fn android_Parcel_writeInt64Vector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt64VectorERKSt10unique_ptrISt6vectorIlSaIlEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeInt64Vector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeInt64VectorERKSt6vectorIlSaIlEE"]
    pub fn android_Parcel_writeInt64Vector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeUint64VectorERKSt8optionalISt6vectorImSaImEEE"]
    pub fn android_Parcel_writeUint64Vector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeUint64VectorERKSt10unique_ptrISt6vectorImSaImEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeUint64Vector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeUint64VectorERKSt6vectorImSaImEE"]
    pub fn android_Parcel_writeUint64Vector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeFloatVectorERKSt8optionalISt6vectorIfSaIfEEE"]
    pub fn android_Parcel_writeFloatVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeFloatVectorERKSt10unique_ptrISt6vectorIfSaIfEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeFloatVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeFloatVectorERKSt6vectorIfSaIfEE"]
    pub fn android_Parcel_writeFloatVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeDoubleVectorERKSt8optionalISt6vectorIdSaIdEEE"]
    pub fn android_Parcel_writeDoubleVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeDoubleVectorERKSt10unique_ptrISt6vectorIdSaIdEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeDoubleVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeDoubleVectorERKSt6vectorIdSaIdEE"]
    pub fn android_Parcel_writeDoubleVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeBoolVectorERKSt8optionalISt6vectorIbSaIbEEE"]
    pub fn android_Parcel_writeBoolVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeBoolVectorERKSt10unique_ptrISt6vectorIbSaIbEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeBoolVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeBoolVectorERKSt6vectorIbSaIbEE"]
    pub fn android_Parcel_writeBoolVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeCharVectorERKSt8optionalISt6vectorIDsSaIDsEEE"]
    pub fn android_Parcel_writeCharVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeCharVectorERKSt10unique_ptrISt6vectorIDsSaIDsEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_writeCharVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeCharVectorERKSt6vectorIDsSaIDsEE"]
    pub fn android_Parcel_writeCharVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19writeString16VectorERKSt8optionalISt6vectorIS1_INS_8String16EESaIS4_EEE"]
    pub fn android_Parcel_writeString16Vector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19writeString16VectorERKSt10unique_ptrISt6vectorIS1_INS_8String16ESt14default_deleteIS3_EESaIS6_EES4_IS8_EE"]
    pub fn android_Parcel_writeString16Vector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19writeString16VectorERKSt6vectorINS_8String16ESaIS2_EE"]
    pub fn android_Parcel_writeString16Vector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel28writeUtf8VectorAsUtf16VectorERKSt8optionalISt6vectorIS1_INSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEESaIS9_EEE"]
    pub fn android_Parcel_writeUtf8VectorAsUtf16Vector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel28writeUtf8VectorAsUtf16VectorERKSt10unique_ptrISt6vectorIS1_INSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt14default_deleteIS8_EESaISB_EES9_ISD_EE"]
    pub fn android_Parcel_writeUtf8VectorAsUtf16Vector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel28writeUtf8VectorAsUtf16VectorERKSt6vectorINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESaIS7_EE"]
    pub fn android_Parcel_writeUtf8VectorAsUtf16Vector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel23writeStrongBinderVectorERKSt8optionalISt6vectorINS_2spINS_7IBinderEEESaIS5_EEE"]
    pub fn android_Parcel_writeStrongBinderVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel23writeStrongBinderVectorERKSt10unique_ptrISt6vectorINS_2spINS_7IBinderEEESaIS5_EESt14default_deleteIS7_EE"]
    pub fn android_Parcel_writeStrongBinderVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel23writeStrongBinderVectorERKSt6vectorINS_2spINS_7IBinderEEESaIS4_EE"]
    pub fn android_Parcel_writeStrongBinderVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel15writeParcelableERKNS_10ParcelableE"]
    pub fn android_Parcel_writeParcelable(
        this: *mut android_Parcel,
        parcelable: *const android_Parcelable,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel17writeNativeHandleEPK13native_handle"]
    pub fn android_Parcel_writeNativeHandle(
        this: *mut android_Parcel,
        handle: *const native_handle,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19writeFileDescriptorEib"]
    pub fn android_Parcel_writeFileDescriptor(
        this: *mut android_Parcel,
        fd: ::std::os::raw::c_int,
        takeOwnership: bool,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel22writeDupFileDescriptorEi"]
    pub fn android_Parcel_writeDupFileDescriptor(
        this: *mut android_Parcel,
        fd: ::std::os::raw::c_int,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel25writeParcelFileDescriptorEib"]
    pub fn android_Parcel_writeParcelFileDescriptor(
        this: *mut android_Parcel,
        fd: ::std::os::raw::c_int,
        takeOwnership: bool,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel28writeDupParcelFileDescriptorEi"]
    pub fn android_Parcel_writeDupParcelFileDescriptor(
        this: *mut android_Parcel,
        fd: ::std::os::raw::c_int,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel25writeUniqueFileDescriptorERKNS_4base14unique_fd_implINS1_13DefaultCloserEEE"]
    pub fn android_Parcel_writeUniqueFileDescriptor(
        this: *mut android_Parcel,
        fd: *const android_base_unique_fd,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel31writeUniqueFileDescriptorVectorERKSt8optionalISt6vectorINS_4base14unique_fd_implINS3_13DefaultCloserEEESaIS6_EEE"]
    pub fn android_Parcel_writeUniqueFileDescriptorVector(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel31writeUniqueFileDescriptorVectorERKSt10unique_ptrISt6vectorINS_4base14unique_fd_implINS3_13DefaultCloserEEESaIS6_EESt14default_deleteIS8_EE"]
    pub fn android_Parcel_writeUniqueFileDescriptorVector1(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel31writeUniqueFileDescriptorVectorERKSt6vectorINS_4base14unique_fd_implINS2_13DefaultCloserEEESaIS5_EE"]
    pub fn android_Parcel_writeUniqueFileDescriptorVector2(
        this: *mut android_Parcel,
        val: *const u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel9writeBlobEmbPNS0_12WritableBlobE"]
    pub fn android_Parcel_writeBlob(
        this: *mut android_Parcel,
        len: size_t,
        mutableCopy: bool,
        outBlob: *mut android_Parcel_WritableBlob,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel35writeDupImmutableBlobFileDescriptorEi"]
    pub fn android_Parcel_writeDupImmutableBlobFileDescriptor(
        this: *mut android_Parcel,
        fd: ::std::os::raw::c_int,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel11writeObjectERKNS_18flat_binder_objectEb"]
    pub fn android_Parcel_writeObject(
        this: *mut android_Parcel,
        val: *const android_flat_binder_object,
        nullMetaData: bool,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel16writeNoExceptionEv"]
    pub fn android_Parcel_writeNoException(this: *mut android_Parcel) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel4readEPvm"]
    pub fn android_Parcel_read(
        this: *const android_Parcel,
        outData: *mut ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel11readInplaceEm"]
    pub fn android_Parcel_readInplace(
        this: *const android_Parcel,
        len: size_t,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readInt32Ev"]
    pub fn android_Parcel_readInt32(this: *const android_Parcel) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readInt32EPi"]
    pub fn android_Parcel_readInt321(
        this: *const android_Parcel,
        pArg: *mut i32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readUint32Ev"]
    pub fn android_Parcel_readUint32(this: *const android_Parcel) -> u32;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readUint32EPj"]
    pub fn android_Parcel_readUint321(
        this: *const android_Parcel,
        pArg: *mut u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readInt64Ev"]
    pub fn android_Parcel_readInt64(this: *const android_Parcel) -> i64;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readInt64EPl"]
    pub fn android_Parcel_readInt641(
        this: *const android_Parcel,
        pArg: *mut i64,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readUint64Ev"]
    pub fn android_Parcel_readUint64(this: *const android_Parcel) -> u64;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readUint64EPm"]
    pub fn android_Parcel_readUint641(
        this: *const android_Parcel,
        pArg: *mut u64,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readFloatEv"]
    pub fn android_Parcel_readFloat(this: *const android_Parcel) -> f32;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel9readFloatEPf"]
    pub fn android_Parcel_readFloat1(
        this: *const android_Parcel,
        pArg: *mut f32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readDoubleEv"]
    pub fn android_Parcel_readDouble(this: *const android_Parcel) -> f64;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readDoubleEPd"]
    pub fn android_Parcel_readDouble1(
        this: *const android_Parcel,
        pArg: *mut f64,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readIntPtrEv"]
    pub fn android_Parcel_readIntPtr(this: *const android_Parcel) -> isize;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readIntPtrEPl"]
    pub fn android_Parcel_readIntPtr1(
        this: *const android_Parcel,
        pArg: *mut isize,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readBoolEv"]
    pub fn android_Parcel_readBool(this: *const android_Parcel) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readBoolEPb"]
    pub fn android_Parcel_readBool1(
        this: *const android_Parcel,
        pArg: *mut bool,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readCharEv"]
    pub fn android_Parcel_readChar(this: *const android_Parcel) -> u16;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readCharEPDs"]
    pub fn android_Parcel_readChar1(
        this: *const android_Parcel,
        pArg: *mut u16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readByteEv"]
    pub fn android_Parcel_readByte(this: *const android_Parcel) -> i8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readByteEPa"]
    pub fn android_Parcel_readByte1(this: *const android_Parcel, pArg: *mut i8)
        -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17readUtf8FromUtf16EPNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn android_Parcel_readUtf8FromUtf16(
        this: *const android_Parcel,
        str: *mut std_string,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17readUtf8FromUtf16EPSt8optionalINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE"]
    pub fn android_Parcel_readUtf8FromUtf161(
        this: *const android_Parcel,
        str: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17readUtf8FromUtf16EPSt10unique_ptrINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt14default_deleteIS7_EE"]
    pub fn android_Parcel_readUtf8FromUtf162(
        this: *const android_Parcel,
        str: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel11readCStringEv"]
    pub fn android_Parcel_readCString(this: *const android_Parcel)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel11readString8Ev"]
    pub fn android_Parcel_readString8(this: *const android_Parcel) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel11readString8EPNS_7String8E"]
    pub fn android_Parcel_readString81(
        this: *const android_Parcel,
        pArg: *mut android_String8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12readString16Ev"]
    pub fn android_Parcel_readString16(this: *const android_Parcel) -> android_String16;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12readString16EPNS_8String16E"]
    pub fn android_Parcel_readString161(
        this: *const android_Parcel,
        pArg: *mut android_String16,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12readString16EPSt8optionalINS_8String16EE"]
    pub fn android_Parcel_readString162(
        this: *const android_Parcel,
        pArg: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel12readString16EPSt10unique_ptrINS_8String16ESt14default_deleteIS2_EE"]
    pub fn android_Parcel_readString163(
        this: *const android_Parcel,
        pArg: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel19readString16InplaceEPm"]
    pub fn android_Parcel_readString16Inplace(
        this: *const android_Parcel,
        outLen: *mut size_t,
    ) -> *const u16;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readStrongBinderEv"]
    pub fn android_Parcel_readStrongBinder(
        this: *const android_Parcel,
    ) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readStrongBinderEPNS_2spINS_7IBinderEEE"]
    pub fn android_Parcel_readStrongBinder1(
        this: *const android_Parcel,
        val: *mut android_sp<android_IBinder>,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel24readNullableStrongBinderEPNS_2spINS_7IBinderEEE"]
    pub fn android_Parcel_readNullableStrongBinder(
        this: *const android_Parcel,
        val: *mut android_sp<android_IBinder>,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readParcelableEPNS_10ParcelableE"]
    pub fn android_Parcel_readParcelable(
        this: *const android_Parcel,
        parcelable: *mut android_Parcelable,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel22readStrongBinderVectorEPSt8optionalISt6vectorINS_2spINS_7IBinderEEESaIS5_EEE"]
    pub fn android_Parcel_readStrongBinderVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel22readStrongBinderVectorEPSt10unique_ptrISt6vectorINS_2spINS_7IBinderEEESaIS5_EESt14default_deleteIS7_EE"]
    pub fn android_Parcel_readStrongBinderVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel22readStrongBinderVectorEPSt6vectorINS_2spINS_7IBinderEEESaIS4_EE"]
    pub fn android_Parcel_readStrongBinderVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt8optionalISt6vectorIaSaIaEEE"]
    pub fn android_Parcel_readByteVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt10unique_ptrISt6vectorIaSaIaEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readByteVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt6vectorIaSaIaEE"]
    pub fn android_Parcel_readByteVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt8optionalISt6vectorIhSaIhEEE"]
    pub fn android_Parcel_readByteVector3(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt10unique_ptrISt6vectorIhSaIhEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readByteVector4(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readByteVectorEPSt6vectorIhSaIhEE"]
    pub fn android_Parcel_readByteVector5(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt32VectorEPSt8optionalISt6vectorIiSaIiEEE"]
    pub fn android_Parcel_readInt32Vector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt32VectorEPSt10unique_ptrISt6vectorIiSaIiEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readInt32Vector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt32VectorEPSt6vectorIiSaIiEE"]
    pub fn android_Parcel_readInt32Vector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt64VectorEPSt8optionalISt6vectorIlSaIlEEE"]
    pub fn android_Parcel_readInt64Vector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt64VectorEPSt10unique_ptrISt6vectorIlSaIlEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readInt64Vector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readInt64VectorEPSt6vectorIlSaIlEE"]
    pub fn android_Parcel_readInt64Vector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readUint64VectorEPSt8optionalISt6vectorImSaImEEE"]
    pub fn android_Parcel_readUint64Vector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readUint64VectorEPSt10unique_ptrISt6vectorImSaImEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readUint64Vector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readUint64VectorEPSt6vectorImSaImEE"]
    pub fn android_Parcel_readUint64Vector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readFloatVectorEPSt8optionalISt6vectorIfSaIfEEE"]
    pub fn android_Parcel_readFloatVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readFloatVectorEPSt10unique_ptrISt6vectorIfSaIfEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readFloatVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel15readFloatVectorEPSt6vectorIfSaIfEE"]
    pub fn android_Parcel_readFloatVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readDoubleVectorEPSt8optionalISt6vectorIdSaIdEEE"]
    pub fn android_Parcel_readDoubleVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readDoubleVectorEPSt10unique_ptrISt6vectorIdSaIdEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readDoubleVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readDoubleVectorEPSt6vectorIdSaIdEE"]
    pub fn android_Parcel_readDoubleVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readBoolVectorEPSt8optionalISt6vectorIbSaIbEEE"]
    pub fn android_Parcel_readBoolVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readBoolVectorEPSt10unique_ptrISt6vectorIbSaIbEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readBoolVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readBoolVectorEPSt6vectorIbSaIbEE"]
    pub fn android_Parcel_readBoolVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readCharVectorEPSt8optionalISt6vectorIDsSaIDsEEE"]
    pub fn android_Parcel_readCharVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readCharVectorEPSt10unique_ptrISt6vectorIDsSaIDsEESt14default_deleteIS4_EE"]
    pub fn android_Parcel_readCharVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel14readCharVectorEPSt6vectorIDsSaIDsEE"]
    pub fn android_Parcel_readCharVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel18readString16VectorEPSt8optionalISt6vectorIS1_INS_8String16EESaIS4_EEE"]
    pub fn android_Parcel_readString16Vector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel18readString16VectorEPSt10unique_ptrISt6vectorIS1_INS_8String16ESt14default_deleteIS3_EESaIS6_EES4_IS8_EE"]
    pub fn android_Parcel_readString16Vector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel18readString16VectorEPSt6vectorINS_8String16ESaIS2_EE"]
    pub fn android_Parcel_readString16Vector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel29readUtf8VectorFromUtf16VectorEPSt8optionalISt6vectorIS1_INSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEESaIS9_EEE"]
    pub fn android_Parcel_readUtf8VectorFromUtf16Vector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel29readUtf8VectorFromUtf16VectorEPSt10unique_ptrISt6vectorIS1_INSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESt14default_deleteIS8_EESaISB_EES9_ISD_EE"]
    pub fn android_Parcel_readUtf8VectorFromUtf16Vector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel29readUtf8VectorFromUtf16VectorEPSt6vectorINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESaIS7_EE"]
    pub fn android_Parcel_readUtf8VectorFromUtf16Vector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17readExceptionCodeEv"]
    pub fn android_Parcel_readExceptionCode(this: *const android_Parcel) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel16readNativeHandleEv"]
    pub fn android_Parcel_readNativeHandle(this: *const android_Parcel) -> *mut native_handle;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel18readFileDescriptorEv"]
    pub fn android_Parcel_readFileDescriptor(this: *const android_Parcel) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel24readParcelFileDescriptorEv"]
    pub fn android_Parcel_readParcelFileDescriptor(
        this: *const android_Parcel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel24readUniqueFileDescriptorEPNS_4base14unique_fd_implINS1_13DefaultCloserEEE"]
    pub fn android_Parcel_readUniqueFileDescriptor(
        this: *const android_Parcel,
        val: *mut android_base_unique_fd,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel30readUniqueParcelFileDescriptorEPNS_4base14unique_fd_implINS1_13DefaultCloserEEE"]
    pub fn android_Parcel_readUniqueParcelFileDescriptor(
        this: *const android_Parcel,
        val: *mut android_base_unique_fd,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel30readUniqueFileDescriptorVectorEPSt8optionalISt6vectorINS_4base14unique_fd_implINS3_13DefaultCloserEEESaIS6_EEE"]
    pub fn android_Parcel_readUniqueFileDescriptorVector(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel30readUniqueFileDescriptorVectorEPSt10unique_ptrISt6vectorINS_4base14unique_fd_implINS3_13DefaultCloserEEESaIS6_EESt14default_deleteIS8_EE"]
    pub fn android_Parcel_readUniqueFileDescriptorVector1(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel30readUniqueFileDescriptorVectorEPSt6vectorINS_4base14unique_fd_implINS2_13DefaultCloserEEESaIS5_EE"]
    pub fn android_Parcel_readUniqueFileDescriptorVector2(
        this: *const android_Parcel,
        val: *mut u8,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel8readBlobEmPNS0_12ReadableBlobE"]
    pub fn android_Parcel_readBlob(
        this: *const android_Parcel,
        len: size_t,
        outBlob: *mut android_Parcel_ReadableBlob,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel10readObjectEb"]
    pub fn android_Parcel_readObject(
        this: *const android_Parcel,
        nullMetaData: bool,
    ) -> *const android_flat_binder_object;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel20closeFileDescriptorsEv"]
    pub fn android_Parcel_closeFileDescriptors(this: *mut android_Parcel);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel18getGlobalAllocSizeEv"]
    pub fn android_Parcel_getGlobalAllocSize() -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel19getGlobalAllocCountEv"]
    pub fn android_Parcel_getGlobalAllocCount() -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6Parcel27replaceCallingWorkSourceUidEj"]
    pub fn android_Parcel_replaceCallingWorkSourceUid(
        this: *mut android_Parcel,
        uid: uid_t,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel24readCallingWorkSourceUidEv"]
    pub fn android_Parcel_readCallingWorkSourceUid(this: *const android_Parcel) -> uid_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel5printERNS_10TextOutputEj"]
    pub fn android_Parcel_print(
        this: *const android_Parcel,
        to: *mut android_TextOutput,
        flags: u32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17getBlobAshmemSizeEv"]
    pub fn android_Parcel_getBlobAshmemSize(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6Parcel17getOpenAshmemSizeEv"]
    pub fn android_Parcel_getOpenAshmemSize(this: *const android_Parcel) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6ParcelC1Ev"]
    pub fn android_Parcel_Parcel(this: *mut android_Parcel);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6ParcelD1Ev"]
    pub fn android_Parcel_Parcel_destructor(this: *mut android_Parcel);
}
impl android_Parcel {
    #[inline]
    pub unsafe fn data(&self) -> *const u8 {
        android_Parcel_data(self)
    }
    #[inline]
    pub unsafe fn dataSize(&self) -> size_t {
        android_Parcel_dataSize(self)
    }
    #[inline]
    pub unsafe fn dataAvail(&self) -> size_t {
        android_Parcel_dataAvail(self)
    }
    #[inline]
    pub unsafe fn dataPosition(&self) -> size_t {
        android_Parcel_dataPosition(self)
    }
    #[inline]
    pub unsafe fn dataCapacity(&self) -> size_t {
        android_Parcel_dataCapacity(self)
    }
    #[inline]
    pub unsafe fn setDataSize(&mut self, size: size_t) -> android_status_t {
        android_Parcel_setDataSize(self, size)
    }
    #[inline]
    pub unsafe fn setDataPosition(&self, pos: size_t) {
        android_Parcel_setDataPosition(self, pos)
    }
    #[inline]
    pub unsafe fn setDataCapacity(&mut self, size: size_t) -> android_status_t {
        android_Parcel_setDataCapacity(self, size)
    }
    #[inline]
    pub unsafe fn setData(&mut self, buffer: *const u8, len: size_t) -> android_status_t {
        android_Parcel_setData(self, buffer, len)
    }
    #[inline]
    pub unsafe fn appendFrom(
        &mut self,
        parcel: *const android_Parcel,
        start: size_t,
        len: size_t,
    ) -> android_status_t {
        android_Parcel_appendFrom(self, parcel, start, len)
    }
    #[inline]
    pub unsafe fn compareData(&mut self, other: *const android_Parcel) -> ::std::os::raw::c_int {
        android_Parcel_compareData(self, other)
    }
    #[inline]
    pub unsafe fn allowFds(&self) -> bool {
        android_Parcel_allowFds(self)
    }
    #[inline]
    pub unsafe fn pushAllowFds(&mut self, allowFds: bool) -> bool {
        android_Parcel_pushAllowFds(self, allowFds)
    }
    #[inline]
    pub unsafe fn restoreAllowFds(&mut self, lastValue: bool) {
        android_Parcel_restoreAllowFds(self, lastValue)
    }
    #[inline]
    pub unsafe fn hasFileDescriptors(&self) -> bool {
        android_Parcel_hasFileDescriptors(self)
    }
    #[inline]
    pub unsafe fn writeInterfaceToken(
        &mut self,
        interface: *const android_String16,
    ) -> android_status_t {
        android_Parcel_writeInterfaceToken(self, interface)
    }
    #[inline]
    pub unsafe fn enforceInterface(
        &self,
        interface: *const android_String16,
        threadState: *mut android_IPCThreadState,
    ) -> bool {
        android_Parcel_enforceInterface(self, interface, threadState)
    }
    #[inline]
    pub unsafe fn enforceInterface1(
        &self,
        interface: *const u16,
        len: size_t,
        threadState: *mut android_IPCThreadState,
    ) -> bool {
        android_Parcel_enforceInterface1(self, interface, len, threadState)
    }
    #[inline]
    pub unsafe fn checkInterface(&self, arg1: *mut android_IBinder) -> bool {
        android_Parcel_checkInterface(self, arg1)
    }
    #[inline]
    pub unsafe fn freeData(&mut self) {
        android_Parcel_freeData(self)
    }
    #[inline]
    pub unsafe fn objectsCount(&self) -> size_t {
        android_Parcel_objectsCount(self)
    }
    #[inline]
    pub unsafe fn errorCheck(&self) -> android_status_t {
        android_Parcel_errorCheck(self)
    }
    #[inline]
    pub unsafe fn setError(&mut self, err: android_status_t) {
        android_Parcel_setError(self, err)
    }
    #[inline]
    pub unsafe fn write(
        &mut self,
        data: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t {
        android_Parcel_write(self, data, len)
    }
    #[inline]
    pub unsafe fn writeInplace(&mut self, len: size_t) -> *mut ::std::os::raw::c_void {
        android_Parcel_writeInplace(self, len)
    }
    #[inline]
    pub unsafe fn writeUnpadded(
        &mut self,
        data: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t {
        android_Parcel_writeUnpadded(self, data, len)
    }
    #[inline]
    pub unsafe fn writeInt32(&mut self, val: i32) -> android_status_t {
        android_Parcel_writeInt32(self, val)
    }
    #[inline]
    pub unsafe fn writeUint32(&mut self, val: u32) -> android_status_t {
        android_Parcel_writeUint32(self, val)
    }
    #[inline]
    pub unsafe fn writeInt64(&mut self, val: i64) -> android_status_t {
        android_Parcel_writeInt64(self, val)
    }
    #[inline]
    pub unsafe fn writeUint64(&mut self, val: u64) -> android_status_t {
        android_Parcel_writeUint64(self, val)
    }
    #[inline]
    pub unsafe fn writeFloat(&mut self, val: f32) -> android_status_t {
        android_Parcel_writeFloat(self, val)
    }
    #[inline]
    pub unsafe fn writeDouble(&mut self, val: f64) -> android_status_t {
        android_Parcel_writeDouble(self, val)
    }
    #[inline]
    pub unsafe fn writeCString(&mut self, str: *const ::std::os::raw::c_char) -> android_status_t {
        android_Parcel_writeCString(self, str)
    }
    #[inline]
    pub unsafe fn writeString8(&mut self, str: *const android_String8) -> android_status_t {
        android_Parcel_writeString8(self, str)
    }
    #[inline]
    pub unsafe fn writeString16(&mut self, str: *const android_String16) -> android_status_t {
        android_Parcel_writeString16(self, str)
    }
    #[inline]
    pub unsafe fn writeString161(&mut self, str: *const u8) -> android_status_t {
        android_Parcel_writeString161(self, str)
    }
    #[inline]
    pub unsafe fn writeString162(&mut self, str: *const u8) -> android_status_t {
        android_Parcel_writeString162(self, str)
    }
    #[inline]
    pub unsafe fn writeString163(&mut self, str: *const u16, len: size_t) -> android_status_t {
        android_Parcel_writeString163(self, str, len)
    }
    #[inline]
    pub unsafe fn writeStrongBinder(
        &mut self,
        val: *const android_sp<android_IBinder>,
    ) -> android_status_t {
        android_Parcel_writeStrongBinder(self, val)
    }
    #[inline]
    pub unsafe fn writeInt32Array(&mut self, len: size_t, val: *const i32) -> android_status_t {
        android_Parcel_writeInt32Array(self, len, val)
    }
    #[inline]
    pub unsafe fn writeByteArray(&mut self, len: size_t, val: *const u8) -> android_status_t {
        android_Parcel_writeByteArray(self, len, val)
    }
    #[inline]
    pub unsafe fn writeBool(&mut self, val: bool) -> android_status_t {
        android_Parcel_writeBool(self, val)
    }
    #[inline]
    pub unsafe fn writeChar(&mut self, val: u16) -> android_status_t {
        android_Parcel_writeChar(self, val)
    }
    #[inline]
    pub unsafe fn writeByte(&mut self, val: i8) -> android_status_t {
        android_Parcel_writeByte(self, val)
    }
    #[inline]
    pub unsafe fn writeUtf8AsUtf16(&mut self, str: *const std_string) -> android_status_t {
        android_Parcel_writeUtf8AsUtf16(self, str)
    }
    #[inline]
    pub unsafe fn writeUtf8AsUtf161(&mut self, str: *const u8) -> android_status_t {
        android_Parcel_writeUtf8AsUtf161(self, str)
    }
    #[inline]
    pub unsafe fn writeUtf8AsUtf162(&mut self, str: *const u8) -> android_status_t {
        android_Parcel_writeUtf8AsUtf162(self, str)
    }
    #[inline]
    pub unsafe fn writeByteVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector(self, val)
    }
    #[inline]
    pub unsafe fn writeByteVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeByteVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeByteVector3(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector3(self, val)
    }
    #[inline]
    pub unsafe fn writeByteVector4(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector4(self, val)
    }
    #[inline]
    pub unsafe fn writeByteVector5(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeByteVector5(self, val)
    }
    #[inline]
    pub unsafe fn writeInt32Vector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt32Vector(self, val)
    }
    #[inline]
    pub unsafe fn writeInt32Vector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt32Vector1(self, val)
    }
    #[inline]
    pub unsafe fn writeInt32Vector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt32Vector2(self, val)
    }
    #[inline]
    pub unsafe fn writeInt64Vector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt64Vector(self, val)
    }
    #[inline]
    pub unsafe fn writeInt64Vector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt64Vector1(self, val)
    }
    #[inline]
    pub unsafe fn writeInt64Vector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeInt64Vector2(self, val)
    }
    #[inline]
    pub unsafe fn writeUint64Vector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUint64Vector(self, val)
    }
    #[inline]
    pub unsafe fn writeUint64Vector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUint64Vector1(self, val)
    }
    #[inline]
    pub unsafe fn writeUint64Vector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUint64Vector2(self, val)
    }
    #[inline]
    pub unsafe fn writeFloatVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeFloatVector(self, val)
    }
    #[inline]
    pub unsafe fn writeFloatVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeFloatVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeFloatVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeFloatVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeDoubleVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeDoubleVector(self, val)
    }
    #[inline]
    pub unsafe fn writeDoubleVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeDoubleVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeDoubleVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeDoubleVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeBoolVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeBoolVector(self, val)
    }
    #[inline]
    pub unsafe fn writeBoolVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeBoolVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeBoolVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeBoolVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeCharVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeCharVector(self, val)
    }
    #[inline]
    pub unsafe fn writeCharVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeCharVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeCharVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeCharVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeString16Vector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeString16Vector(self, val)
    }
    #[inline]
    pub unsafe fn writeString16Vector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeString16Vector1(self, val)
    }
    #[inline]
    pub unsafe fn writeString16Vector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeString16Vector2(self, val)
    }
    #[inline]
    pub unsafe fn writeUtf8VectorAsUtf16Vector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUtf8VectorAsUtf16Vector(self, val)
    }
    #[inline]
    pub unsafe fn writeUtf8VectorAsUtf16Vector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUtf8VectorAsUtf16Vector1(self, val)
    }
    #[inline]
    pub unsafe fn writeUtf8VectorAsUtf16Vector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUtf8VectorAsUtf16Vector2(self, val)
    }
    #[inline]
    pub unsafe fn writeStrongBinderVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeStrongBinderVector(self, val)
    }
    #[inline]
    pub unsafe fn writeStrongBinderVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeStrongBinderVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeStrongBinderVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeStrongBinderVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeParcelable(
        &mut self,
        parcelable: *const android_Parcelable,
    ) -> android_status_t {
        android_Parcel_writeParcelable(self, parcelable)
    }
    #[inline]
    pub unsafe fn writeNativeHandle(&mut self, handle: *const native_handle) -> android_status_t {
        android_Parcel_writeNativeHandle(self, handle)
    }
    #[inline]
    pub unsafe fn writeFileDescriptor(
        &mut self,
        fd: ::std::os::raw::c_int,
        takeOwnership: bool,
    ) -> android_status_t {
        android_Parcel_writeFileDescriptor(self, fd, takeOwnership)
    }
    #[inline]
    pub unsafe fn writeDupFileDescriptor(&mut self, fd: ::std::os::raw::c_int) -> android_status_t {
        android_Parcel_writeDupFileDescriptor(self, fd)
    }
    #[inline]
    pub unsafe fn writeParcelFileDescriptor(
        &mut self,
        fd: ::std::os::raw::c_int,
        takeOwnership: bool,
    ) -> android_status_t {
        android_Parcel_writeParcelFileDescriptor(self, fd, takeOwnership)
    }
    #[inline]
    pub unsafe fn writeDupParcelFileDescriptor(
        &mut self,
        fd: ::std::os::raw::c_int,
    ) -> android_status_t {
        android_Parcel_writeDupParcelFileDescriptor(self, fd)
    }
    #[inline]
    pub unsafe fn writeUniqueFileDescriptor(
        &mut self,
        fd: *const android_base_unique_fd,
    ) -> android_status_t {
        android_Parcel_writeUniqueFileDescriptor(self, fd)
    }
    #[inline]
    pub unsafe fn writeUniqueFileDescriptorVector(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUniqueFileDescriptorVector(self, val)
    }
    #[inline]
    pub unsafe fn writeUniqueFileDescriptorVector1(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUniqueFileDescriptorVector1(self, val)
    }
    #[inline]
    pub unsafe fn writeUniqueFileDescriptorVector2(&mut self, val: *const u8) -> android_status_t {
        android_Parcel_writeUniqueFileDescriptorVector2(self, val)
    }
    #[inline]
    pub unsafe fn writeBlob(
        &mut self,
        len: size_t,
        mutableCopy: bool,
        outBlob: *mut android_Parcel_WritableBlob,
    ) -> android_status_t {
        android_Parcel_writeBlob(self, len, mutableCopy, outBlob)
    }
    #[inline]
    pub unsafe fn writeDupImmutableBlobFileDescriptor(
        &mut self,
        fd: ::std::os::raw::c_int,
    ) -> android_status_t {
        android_Parcel_writeDupImmutableBlobFileDescriptor(self, fd)
    }
    #[inline]
    pub unsafe fn writeObject(
        &mut self,
        val: *const android_flat_binder_object,
        nullMetaData: bool,
    ) -> android_status_t {
        android_Parcel_writeObject(self, val, nullMetaData)
    }
    #[inline]
    pub unsafe fn writeNoException(&mut self) -> android_status_t {
        android_Parcel_writeNoException(self)
    }
    #[inline]
    pub unsafe fn read(
        &self,
        outData: *mut ::std::os::raw::c_void,
        len: size_t,
    ) -> android_status_t {
        android_Parcel_read(self, outData, len)
    }
    #[inline]
    pub unsafe fn readInplace(&self, len: size_t) -> *const ::std::os::raw::c_void {
        android_Parcel_readInplace(self, len)
    }
    #[inline]
    pub unsafe fn readInt32(&self) -> i32 {
        android_Parcel_readInt32(self)
    }
    #[inline]
    pub unsafe fn readInt321(&self, pArg: *mut i32) -> android_status_t {
        android_Parcel_readInt321(self, pArg)
    }
    #[inline]
    pub unsafe fn readUint32(&self) -> u32 {
        android_Parcel_readUint32(self)
    }
    #[inline]
    pub unsafe fn readUint321(&self, pArg: *mut u32) -> android_status_t {
        android_Parcel_readUint321(self, pArg)
    }
    #[inline]
    pub unsafe fn readInt64(&self) -> i64 {
        android_Parcel_readInt64(self)
    }
    #[inline]
    pub unsafe fn readInt641(&self, pArg: *mut i64) -> android_status_t {
        android_Parcel_readInt641(self, pArg)
    }
    #[inline]
    pub unsafe fn readUint64(&self) -> u64 {
        android_Parcel_readUint64(self)
    }
    #[inline]
    pub unsafe fn readUint641(&self, pArg: *mut u64) -> android_status_t {
        android_Parcel_readUint641(self, pArg)
    }
    #[inline]
    pub unsafe fn readFloat(&self) -> f32 {
        android_Parcel_readFloat(self)
    }
    #[inline]
    pub unsafe fn readFloat1(&self, pArg: *mut f32) -> android_status_t {
        android_Parcel_readFloat1(self, pArg)
    }
    #[inline]
    pub unsafe fn readDouble(&self) -> f64 {
        android_Parcel_readDouble(self)
    }
    #[inline]
    pub unsafe fn readDouble1(&self, pArg: *mut f64) -> android_status_t {
        android_Parcel_readDouble1(self, pArg)
    }
    #[inline]
    pub unsafe fn readIntPtr(&self) -> isize {
        android_Parcel_readIntPtr(self)
    }
    #[inline]
    pub unsafe fn readIntPtr1(&self, pArg: *mut isize) -> android_status_t {
        android_Parcel_readIntPtr1(self, pArg)
    }
    #[inline]
    pub unsafe fn readBool(&self) -> bool {
        android_Parcel_readBool(self)
    }
    #[inline]
    pub unsafe fn readBool1(&self, pArg: *mut bool) -> android_status_t {
        android_Parcel_readBool1(self, pArg)
    }
    #[inline]
    pub unsafe fn readChar(&self) -> u16 {
        android_Parcel_readChar(self)
    }
    #[inline]
    pub unsafe fn readChar1(&self, pArg: *mut u16) -> android_status_t {
        android_Parcel_readChar1(self, pArg)
    }
    #[inline]
    pub unsafe fn readByte(&self) -> i8 {
        android_Parcel_readByte(self)
    }
    #[inline]
    pub unsafe fn readByte1(&self, pArg: *mut i8) -> android_status_t {
        android_Parcel_readByte1(self, pArg)
    }
    #[inline]
    pub unsafe fn readUtf8FromUtf16(&self, str: *mut std_string) -> android_status_t {
        android_Parcel_readUtf8FromUtf16(self, str)
    }
    #[inline]
    pub unsafe fn readUtf8FromUtf161(&self, str: *mut u8) -> android_status_t {
        android_Parcel_readUtf8FromUtf161(self, str)
    }
    #[inline]
    pub unsafe fn readUtf8FromUtf162(&self, str: *mut u8) -> android_status_t {
        android_Parcel_readUtf8FromUtf162(self, str)
    }
    #[inline]
    pub unsafe fn readCString(&self) -> *const ::std::os::raw::c_char {
        android_Parcel_readCString(self)
    }
    #[inline]
    pub unsafe fn readString8(&self) -> android_String8 {
        android_Parcel_readString8(self)
    }
    #[inline]
    pub unsafe fn readString81(&self, pArg: *mut android_String8) -> android_status_t {
        android_Parcel_readString81(self, pArg)
    }
    #[inline]
    pub unsafe fn readString16(&self) -> android_String16 {
        android_Parcel_readString16(self)
    }
    #[inline]
    pub unsafe fn readString161(&self, pArg: *mut android_String16) -> android_status_t {
        android_Parcel_readString161(self, pArg)
    }
    #[inline]
    pub unsafe fn readString162(&self, pArg: *mut u8) -> android_status_t {
        android_Parcel_readString162(self, pArg)
    }
    #[inline]
    pub unsafe fn readString163(&self, pArg: *mut u8) -> android_status_t {
        android_Parcel_readString163(self, pArg)
    }
    #[inline]
    pub unsafe fn readString16Inplace(&self, outLen: *mut size_t) -> *const u16 {
        android_Parcel_readString16Inplace(self, outLen)
    }
    #[inline]
    pub unsafe fn readStrongBinder(&self) -> android_sp<android_IBinder> {
        android_Parcel_readStrongBinder(self)
    }
    #[inline]
    pub unsafe fn readStrongBinder1(
        &self,
        val: *mut android_sp<android_IBinder>,
    ) -> android_status_t {
        android_Parcel_readStrongBinder1(self, val)
    }
    #[inline]
    pub unsafe fn readNullableStrongBinder(
        &self,
        val: *mut android_sp<android_IBinder>,
    ) -> android_status_t {
        android_Parcel_readNullableStrongBinder(self, val)
    }
    #[inline]
    pub unsafe fn readParcelable(&self, parcelable: *mut android_Parcelable) -> android_status_t {
        android_Parcel_readParcelable(self, parcelable)
    }
    #[inline]
    pub unsafe fn readStrongBinderVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readStrongBinderVector(self, val)
    }
    #[inline]
    pub unsafe fn readStrongBinderVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readStrongBinderVector1(self, val)
    }
    #[inline]
    pub unsafe fn readStrongBinderVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readStrongBinderVector2(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector1(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector2(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector3(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector3(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector4(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector4(self, val)
    }
    #[inline]
    pub unsafe fn readByteVector5(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readByteVector5(self, val)
    }
    #[inline]
    pub unsafe fn readInt32Vector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt32Vector(self, val)
    }
    #[inline]
    pub unsafe fn readInt32Vector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt32Vector1(self, val)
    }
    #[inline]
    pub unsafe fn readInt32Vector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt32Vector2(self, val)
    }
    #[inline]
    pub unsafe fn readInt64Vector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt64Vector(self, val)
    }
    #[inline]
    pub unsafe fn readInt64Vector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt64Vector1(self, val)
    }
    #[inline]
    pub unsafe fn readInt64Vector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readInt64Vector2(self, val)
    }
    #[inline]
    pub unsafe fn readUint64Vector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUint64Vector(self, val)
    }
    #[inline]
    pub unsafe fn readUint64Vector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUint64Vector1(self, val)
    }
    #[inline]
    pub unsafe fn readUint64Vector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUint64Vector2(self, val)
    }
    #[inline]
    pub unsafe fn readFloatVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readFloatVector(self, val)
    }
    #[inline]
    pub unsafe fn readFloatVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readFloatVector1(self, val)
    }
    #[inline]
    pub unsafe fn readFloatVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readFloatVector2(self, val)
    }
    #[inline]
    pub unsafe fn readDoubleVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readDoubleVector(self, val)
    }
    #[inline]
    pub unsafe fn readDoubleVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readDoubleVector1(self, val)
    }
    #[inline]
    pub unsafe fn readDoubleVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readDoubleVector2(self, val)
    }
    #[inline]
    pub unsafe fn readBoolVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readBoolVector(self, val)
    }
    #[inline]
    pub unsafe fn readBoolVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readBoolVector1(self, val)
    }
    #[inline]
    pub unsafe fn readBoolVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readBoolVector2(self, val)
    }
    #[inline]
    pub unsafe fn readCharVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readCharVector(self, val)
    }
    #[inline]
    pub unsafe fn readCharVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readCharVector1(self, val)
    }
    #[inline]
    pub unsafe fn readCharVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readCharVector2(self, val)
    }
    #[inline]
    pub unsafe fn readString16Vector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readString16Vector(self, val)
    }
    #[inline]
    pub unsafe fn readString16Vector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readString16Vector1(self, val)
    }
    #[inline]
    pub unsafe fn readString16Vector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readString16Vector2(self, val)
    }
    #[inline]
    pub unsafe fn readUtf8VectorFromUtf16Vector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUtf8VectorFromUtf16Vector(self, val)
    }
    #[inline]
    pub unsafe fn readUtf8VectorFromUtf16Vector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUtf8VectorFromUtf16Vector1(self, val)
    }
    #[inline]
    pub unsafe fn readUtf8VectorFromUtf16Vector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUtf8VectorFromUtf16Vector2(self, val)
    }
    #[inline]
    pub unsafe fn readExceptionCode(&self) -> i32 {
        android_Parcel_readExceptionCode(self)
    }
    #[inline]
    pub unsafe fn readNativeHandle(&self) -> *mut native_handle {
        android_Parcel_readNativeHandle(self)
    }
    #[inline]
    pub unsafe fn readFileDescriptor(&self) -> ::std::os::raw::c_int {
        android_Parcel_readFileDescriptor(self)
    }
    #[inline]
    pub unsafe fn readParcelFileDescriptor(&self) -> ::std::os::raw::c_int {
        android_Parcel_readParcelFileDescriptor(self)
    }
    #[inline]
    pub unsafe fn readUniqueFileDescriptor(
        &self,
        val: *mut android_base_unique_fd,
    ) -> android_status_t {
        android_Parcel_readUniqueFileDescriptor(self, val)
    }
    #[inline]
    pub unsafe fn readUniqueParcelFileDescriptor(
        &self,
        val: *mut android_base_unique_fd,
    ) -> android_status_t {
        android_Parcel_readUniqueParcelFileDescriptor(self, val)
    }
    #[inline]
    pub unsafe fn readUniqueFileDescriptorVector(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUniqueFileDescriptorVector(self, val)
    }
    #[inline]
    pub unsafe fn readUniqueFileDescriptorVector1(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUniqueFileDescriptorVector1(self, val)
    }
    #[inline]
    pub unsafe fn readUniqueFileDescriptorVector2(&self, val: *mut u8) -> android_status_t {
        android_Parcel_readUniqueFileDescriptorVector2(self, val)
    }
    #[inline]
    pub unsafe fn readBlob(
        &self,
        len: size_t,
        outBlob: *mut android_Parcel_ReadableBlob,
    ) -> android_status_t {
        android_Parcel_readBlob(self, len, outBlob)
    }
    #[inline]
    pub unsafe fn readObject(&self, nullMetaData: bool) -> *const android_flat_binder_object {
        android_Parcel_readObject(self, nullMetaData)
    }
    #[inline]
    pub unsafe fn closeFileDescriptors(&mut self) {
        android_Parcel_closeFileDescriptors(self)
    }
    #[inline]
    pub unsafe fn getGlobalAllocSize() -> size_t {
        android_Parcel_getGlobalAllocSize()
    }
    #[inline]
    pub unsafe fn getGlobalAllocCount() -> size_t {
        android_Parcel_getGlobalAllocCount()
    }
    #[inline]
    pub unsafe fn replaceCallingWorkSourceUid(&mut self, uid: uid_t) -> bool {
        android_Parcel_replaceCallingWorkSourceUid(self, uid)
    }
    #[inline]
    pub unsafe fn readCallingWorkSourceUid(&self) -> uid_t {
        android_Parcel_readCallingWorkSourceUid(self)
    }
    #[inline]
    pub unsafe fn print(&self, to: *mut android_TextOutput, flags: u32) {
        android_Parcel_print(self, to, flags)
    }
    #[inline]
    pub unsafe fn getBlobAshmemSize(&self) -> size_t {
        android_Parcel_getBlobAshmemSize(self)
    }
    #[inline]
    pub unsafe fn getOpenAshmemSize(&self) -> size_t {
        android_Parcel_getOpenAshmemSize(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        android_Parcel_Parcel(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        android_Parcel_Parcel_destructor(self)
    }
}
#[repr(C)]
pub struct android_ProcessState {
    pub __bindgen_padding_0: u64,
    pub mDriverName: android_String8,
    pub mDriverFD: ::std::os::raw::c_int,
    pub mVMStart: *mut ::std::os::raw::c_void,
    pub mThreadCountLock: pthread_mutex_t,
    pub mThreadCountDecrement: pthread_cond_t,
    pub mExecutingThreadsCount: size_t,
    pub mMaxThreads: size_t,
    pub mStarvationStartTimeMs: i64,
    pub mLock: android_Mutex,
    pub mHandleToObject: android_Vector,
    pub mBinderContextCheckFunc: android_ProcessState_context_check_func,
    pub mBinderContextUserData: *mut ::std::os::raw::c_void,
    pub mRootDir: android_String8,
    pub mThreadPoolStarted: bool,
    pub mThreadPoolSeq: i32,
    pub mCallRestriction: android_ProcessState_CallRestriction,
    pub __bindgen_padding_1: [u64; 2usize],
}
pub type android_ProcessState_context_check_func = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const android_String16,
        caller: *const android_sp<android_IBinder>,
        userData: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
pub const android_ProcessState_CallRestriction_NONE: android_ProcessState_CallRestriction = 0;
pub const android_ProcessState_CallRestriction_ERROR_IF_NOT_ONEWAY:
    android_ProcessState_CallRestriction = 1;
pub const android_ProcessState_CallRestriction_FATAL_IF_NOT_ONEWAY:
    android_ProcessState_CallRestriction = 2;
pub type android_ProcessState_CallRestriction = i32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct android_ProcessState_handle_entry {
    pub binder: *mut android_IBinder,
    pub refs: *mut android_RefBase_weakref_type,
}
#[test]
fn bindgen_test_layout_android_ProcessState_handle_entry() {
    assert_eq!(
        ::std::mem::size_of::<android_ProcessState_handle_entry>(),
        16usize,
        concat!("Size of: ", stringify!(android_ProcessState_handle_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<android_ProcessState_handle_entry>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(android_ProcessState_handle_entry)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState_handle_entry>())).binder as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState_handle_entry),
            "::",
            stringify!(binder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState_handle_entry>())).refs as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState_handle_entry),
            "::",
            stringify!(refs)
        )
    );
}
#[test]
fn bindgen_test_layout_android_ProcessState() {
    assert_eq!(
        ::std::mem::size_of::<android_ProcessState>(),
        280usize,
        concat!("Size of: ", stringify!(android_ProcessState))
    );
    assert_eq!(
        ::std::mem::align_of::<android_ProcessState>(),
        8usize,
        concat!("Alignment of ", stringify!(android_ProcessState))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mDriverName as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mDriverName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_ProcessState>())).mDriverFD as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mDriverFD)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_ProcessState>())).mVMStart as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mVMStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mThreadCountLock as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mThreadCountLock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mThreadCountDecrement as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mThreadCountDecrement)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mExecutingThreadsCount as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mExecutingThreadsCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mMaxThreads as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mMaxThreads)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mStarvationStartTimeMs as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mStarvationStartTimeMs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_ProcessState>())).mLock as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mLock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mHandleToObject as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mHandleToObject)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mBinderContextCheckFunc as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mBinderContextCheckFunc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mBinderContextUserData as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mBinderContextUserData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_ProcessState>())).mRootDir as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mRootDir)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mThreadPoolStarted as *const _ as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mThreadPoolStarted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mThreadPoolSeq as *const _ as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mThreadPoolSeq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_ProcessState>())).mCallRestriction as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(android_ProcessState),
            "::",
            stringify!(mCallRestriction)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState4selfEv"]
    pub fn android_ProcessState_self() -> android_sp<android_ProcessState>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState10selfOrNullEv"]
    pub fn android_ProcessState_selfOrNull() -> android_sp<android_ProcessState>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState14initWithDriverEPKc"]
    pub fn android_ProcessState_initWithDriver(
        driver: *const ::std::os::raw::c_char,
    ) -> android_sp<android_ProcessState>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState16getContextObjectERKNS_2spINS_7IBinderEEE"]
    pub fn android_ProcessState_getContextObject(
        this: *mut android_ProcessState,
        caller: *const android_sp<android_IBinder>,
    ) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState15startThreadPoolEv"]
    pub fn android_ProcessState_startThreadPool(this: *mut android_ProcessState);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState20becomeContextManagerEPFbRKNS_8String16ERKNS_2spINS_7IBinderEEEPvES9_"]
    pub fn android_ProcessState_becomeContextManager(
        this: *mut android_ProcessState,
        checkFunc: android_ProcessState_context_check_func,
        userData: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState23getStrongProxyForHandleEi"]
    pub fn android_ProcessState_getStrongProxyForHandle(
        this: *mut android_ProcessState,
        handle: i32,
    ) -> android_sp<android_IBinder>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState13expungeHandleEiPNS_7IBinderE"]
    pub fn android_ProcessState_expungeHandle(
        this: *mut android_ProcessState,
        handle: i32,
        binder: *mut android_IBinder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState17spawnPooledThreadEb"]
    pub fn android_ProcessState_spawnPooledThread(this: *mut android_ProcessState, isMain: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState27setThreadPoolMaxThreadCountEm"]
    pub fn android_ProcessState_setThreadPoolMaxThreadCount(
        this: *mut android_ProcessState,
        maxThreads: size_t,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState18giveThreadPoolNameEv"]
    pub fn android_ProcessState_giveThreadPoolName(this: *mut android_ProcessState);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState13getDriverNameEv"]
    pub fn android_ProcessState_getDriverName(this: *mut android_ProcessState) -> android_String8;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState19getKernelReferencesEmPm"]
    pub fn android_ProcessState_getKernelReferences(
        this: *mut android_ProcessState,
        count: size_t,
        buf: *mut usize,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState32getStrongRefCountForNodeByHandleEi"]
    pub fn android_ProcessState_getStrongRefCountForNodeByHandle(
        this: *mut android_ProcessState,
        handle: i32,
    ) -> ssize_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android12ProcessState18setCallRestrictionENS0_15CallRestrictionE"]
    pub fn android_ProcessState_setCallRestriction(
        this: *mut android_ProcessState,
        restriction: android_ProcessState_CallRestriction,
    );
}
impl android_ProcessState {
    #[inline]
    pub unsafe fn self_() -> android_sp<android_ProcessState> {
        android_ProcessState_self()
    }
    #[inline]
    pub unsafe fn selfOrNull() -> android_sp<android_ProcessState> {
        android_ProcessState_selfOrNull()
    }
    #[inline]
    pub unsafe fn initWithDriver(
        driver: *const ::std::os::raw::c_char,
    ) -> android_sp<android_ProcessState> {
        android_ProcessState_initWithDriver(driver)
    }
    #[inline]
    pub unsafe fn getContextObject(
        &mut self,
        caller: *const android_sp<android_IBinder>,
    ) -> android_sp<android_IBinder> {
        android_ProcessState_getContextObject(self, caller)
    }
    #[inline]
    pub unsafe fn startThreadPool(&mut self) {
        android_ProcessState_startThreadPool(self)
    }
    #[inline]
    pub unsafe fn becomeContextManager(
        &mut self,
        checkFunc: android_ProcessState_context_check_func,
        userData: *mut ::std::os::raw::c_void,
    ) -> bool {
        android_ProcessState_becomeContextManager(self, checkFunc, userData)
    }
    #[inline]
    pub unsafe fn getStrongProxyForHandle(&mut self, handle: i32) -> android_sp<android_IBinder> {
        android_ProcessState_getStrongProxyForHandle(self, handle)
    }
    #[inline]
    pub unsafe fn expungeHandle(&mut self, handle: i32, binder: *mut android_IBinder) {
        android_ProcessState_expungeHandle(self, handle, binder)
    }
    #[inline]
    pub unsafe fn spawnPooledThread(&mut self, isMain: bool) {
        android_ProcessState_spawnPooledThread(self, isMain)
    }
    #[inline]
    pub unsafe fn setThreadPoolMaxThreadCount(&mut self, maxThreads: size_t) -> android_status_t {
        android_ProcessState_setThreadPoolMaxThreadCount(self, maxThreads)
    }
    #[inline]
    pub unsafe fn giveThreadPoolName(&mut self) {
        android_ProcessState_giveThreadPoolName(self)
    }
    #[inline]
    pub unsafe fn getDriverName(&mut self) -> android_String8 {
        android_ProcessState_getDriverName(self)
    }
    #[inline]
    pub unsafe fn getKernelReferences(&mut self, count: size_t, buf: *mut usize) -> ssize_t {
        android_ProcessState_getKernelReferences(self, count, buf)
    }
    #[inline]
    pub unsafe fn getStrongRefCountForNodeByHandle(&mut self, handle: i32) -> ssize_t {
        android_ProcessState_getStrongRefCountForNodeByHandle(self, handle)
    }
    #[inline]
    pub unsafe fn setCallRestriction(&mut self, restriction: android_ProcessState_CallRestriction) {
        android_ProcessState_setCallRestriction(self, restriction)
    }
}
#[repr(C)]
pub struct android_IPCThreadState {
    pub mProcess: android_sp<android_ProcessState>,
    pub mPendingStrongDerefs: android_Vector,
    pub mPendingWeakDerefs: android_Vector,
    pub mPostWriteStrongDerefs: android_Vector,
    pub mPostWriteWeakDerefs: android_Vector,
    pub mIn: android_Parcel,
    pub mOut: android_Parcel,
    pub mLastError: android_status_t,
    pub mServingStackPointer: *const ::std::os::raw::c_void,
    pub mCallingPid: pid_t,
    pub mCallingSid: *const ::std::os::raw::c_char,
    pub mCallingUid: uid_t,
    pub mWorkSource: i32,
    pub mPropagateWorkSource: bool,
    pub mStrictModePolicy: i32,
    pub mLastTransactionBinderFlags: i32,
    pub mCallRestriction: android_ProcessState_CallRestriction,
}
pub const android_IPCThreadState_kUnsetWorkSource: i32 = -1;
#[test]
fn bindgen_test_layout_android_IPCThreadState() {
    assert_eq!(
        ::std::mem::size_of::<android_IPCThreadState>(),
        464usize,
        concat!("Size of: ", stringify!(android_IPCThreadState))
    );
    assert_eq!(
        ::std::mem::align_of::<android_IPCThreadState>(),
        8usize,
        concat!("Alignment of ", stringify!(android_IPCThreadState))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_IPCThreadState>())).mProcess as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mProcess)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mPendingStrongDerefs as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mPendingStrongDerefs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mPendingWeakDerefs as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mPendingWeakDerefs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mPostWriteStrongDerefs as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mPostWriteStrongDerefs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mPostWriteWeakDerefs as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mPostWriteWeakDerefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_IPCThreadState>())).mIn as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mIn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_IPCThreadState>())).mOut as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mLastError as *const _ as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mLastError)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mServingStackPointer as *const _
                as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mServingStackPointer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mCallingPid as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mCallingPid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mCallingSid as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mCallingSid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mCallingUid as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mCallingUid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mWorkSource as *const _ as usize
        },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mWorkSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mPropagateWorkSource as *const _
                as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mPropagateWorkSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mStrictModePolicy as *const _
                as usize
        },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mStrictModePolicy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mLastTransactionBinderFlags
                as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mLastTransactionBinderFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_IPCThreadState>())).mCallRestriction as *const _ as usize
        },
        460usize,
        concat!(
            "Offset of field: ",
            stringify!(android_IPCThreadState),
            "::",
            stringify!(mCallRestriction)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState4selfEv"]
    pub fn android_IPCThreadState_self() -> *mut android_IPCThreadState;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState10selfOrNullEv"]
    pub fn android_IPCThreadState_selfOrNull() -> *mut android_IPCThreadState;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState7processEv"]
    pub fn android_IPCThreadState_process(
        this: *mut android_IPCThreadState,
    ) -> android_sp<android_ProcessState>;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState14clearLastErrorEv"]
    pub fn android_IPCThreadState_clearLastError(
        this: *mut android_IPCThreadState,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState13getCallingPidEv"]
    pub fn android_IPCThreadState_getCallingPid(this: *const android_IPCThreadState) -> pid_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState13getCallingSidEv"]
    pub fn android_IPCThreadState_getCallingSid(
        this: *const android_IPCThreadState,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState13getCallingUidEv"]
    pub fn android_IPCThreadState_getCallingUid(this: *const android_IPCThreadState) -> uid_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState19setStrictModePolicyEi"]
    pub fn android_IPCThreadState_setStrictModePolicy(
        this: *mut android_IPCThreadState,
        policy: i32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState19getStrictModePolicyEv"]
    pub fn android_IPCThreadState_getStrictModePolicy(this: *const android_IPCThreadState) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState23setCallingWorkSourceUidEj"]
    pub fn android_IPCThreadState_setCallingWorkSourceUid(
        this: *mut android_IPCThreadState,
        uid: uid_t,
    ) -> i64;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState41setCallingWorkSourceUidWithoutPropagationEj"]
    pub fn android_IPCThreadState_setCallingWorkSourceUidWithoutPropagation(
        this: *mut android_IPCThreadState,
        uid: uid_t,
    ) -> i64;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState23getCallingWorkSourceUidEv"]
    pub fn android_IPCThreadState_getCallingWorkSourceUid(
        this: *const android_IPCThreadState,
    ) -> uid_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState22clearCallingWorkSourceEv"]
    pub fn android_IPCThreadState_clearCallingWorkSource(this: *mut android_IPCThreadState) -> i64;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState24restoreCallingWorkSourceEl"]
    pub fn android_IPCThreadState_restoreCallingWorkSource(
        this: *mut android_IPCThreadState,
        token: i64,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState24clearPropagateWorkSourceEv"]
    pub fn android_IPCThreadState_clearPropagateWorkSource(this: *mut android_IPCThreadState);
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState25shouldPropagateWorkSourceEv"]
    pub fn android_IPCThreadState_shouldPropagateWorkSource(
        this: *const android_IPCThreadState,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState29setLastTransactionBinderFlagsEi"]
    pub fn android_IPCThreadState_setLastTransactionBinderFlags(
        this: *mut android_IPCThreadState,
        flags: i32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState29getLastTransactionBinderFlagsEv"]
    pub fn android_IPCThreadState_getLastTransactionBinderFlags(
        this: *const android_IPCThreadState,
    ) -> i32;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState20clearCallingIdentityEv"]
    pub fn android_IPCThreadState_clearCallingIdentity(this: *mut android_IPCThreadState) -> i64;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState22restoreCallingIdentityEl"]
    pub fn android_IPCThreadState_restoreCallingIdentity(
        this: *mut android_IPCThreadState,
        token: i64,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState12setupPollingEPi"]
    pub fn android_IPCThreadState_setupPolling(
        this: *mut android_IPCThreadState,
        fd: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState20handlePolledCommandsEv"]
    pub fn android_IPCThreadState_handlePolledCommands(
        this: *mut android_IPCThreadState,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState13flushCommandsEv"]
    pub fn android_IPCThreadState_flushCommands(this: *mut android_IPCThreadState);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState14joinThreadPoolEb"]
    pub fn android_IPCThreadState_joinThreadPool(this: *mut android_IPCThreadState, isMain: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState11stopProcessEb"]
    pub fn android_IPCThreadState_stopProcess(this: *mut android_IPCThreadState, immediate: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState8transactEijRKNS_6ParcelEPS1_j"]
    pub fn android_IPCThreadState_transact(
        this: *mut android_IPCThreadState,
        handle: i32,
        code: u32,
        data: *const android_Parcel,
        reply: *mut android_Parcel,
        flags: u32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState15incStrongHandleEiPNS_8BpBinderE"]
    pub fn android_IPCThreadState_incStrongHandle(
        this: *mut android_IPCThreadState,
        handle: i32,
        proxy: *mut android_BpBinder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState15decStrongHandleEi"]
    pub fn android_IPCThreadState_decStrongHandle(this: *mut android_IPCThreadState, handle: i32);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState13incWeakHandleEiPNS_8BpBinderE"]
    pub fn android_IPCThreadState_incWeakHandle(
        this: *mut android_IPCThreadState,
        handle: i32,
        proxy: *mut android_BpBinder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState13decWeakHandleEi"]
    pub fn android_IPCThreadState_decWeakHandle(this: *mut android_IPCThreadState, handle: i32);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState22attemptIncStrongHandleEi"]
    pub fn android_IPCThreadState_attemptIncStrongHandle(
        this: *mut android_IPCThreadState,
        handle: i32,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState13expungeHandleEiPNS_7IBinderE"]
    pub fn android_IPCThreadState_expungeHandle(handle: i32, binder: *mut android_IBinder);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState24requestDeathNotificationEiPNS_8BpBinderE"]
    pub fn android_IPCThreadState_requestDeathNotification(
        this: *mut android_IPCThreadState,
        handle: i32,
        proxy: *mut android_BpBinder,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState22clearDeathNotificationEiPNS_8BpBinderE"]
    pub fn android_IPCThreadState_clearDeathNotification(
        this: *mut android_IPCThreadState,
        handle: i32,
        proxy: *mut android_BpBinder,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState8shutdownEv"]
    pub fn android_IPCThreadState_shutdown();
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState27disableBackgroundSchedulingEb"]
    pub fn android_IPCThreadState_disableBackgroundScheduling(disable: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState28backgroundSchedulingDisabledEv"]
    pub fn android_IPCThreadState_backgroundSchedulingDisabled(
        this: *mut android_IPCThreadState,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState25blockUntilThreadAvailableEv"]
    pub fn android_IPCThreadState_blockUntilThreadAvailable(this: *mut android_IPCThreadState);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android14IPCThreadState19setTheContextObjectENS_2spINS_7BBinderEEE"]
    pub fn android_IPCThreadState_setTheContextObject(
        this: *mut android_IPCThreadState,
        obj: android_sp<android_BBinder>,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android14IPCThreadState22getServingStackPointerEv"]
    pub fn android_IPCThreadState_getServingStackPointer(
        this: *const android_IPCThreadState,
    ) -> *const ::std::os::raw::c_void;
}
impl android_IPCThreadState {
    #[inline]
    pub unsafe fn self_() -> *mut android_IPCThreadState {
        android_IPCThreadState_self()
    }
    #[inline]
    pub unsafe fn selfOrNull() -> *mut android_IPCThreadState {
        android_IPCThreadState_selfOrNull()
    }
    #[inline]
    pub unsafe fn process(&mut self) -> android_sp<android_ProcessState> {
        android_IPCThreadState_process(self)
    }
    #[inline]
    pub unsafe fn clearLastError(&mut self) -> android_status_t {
        android_IPCThreadState_clearLastError(self)
    }
    #[inline]
    pub unsafe fn getCallingPid(&self) -> pid_t {
        android_IPCThreadState_getCallingPid(self)
    }
    #[inline]
    pub unsafe fn getCallingSid(&self) -> *const ::std::os::raw::c_char {
        android_IPCThreadState_getCallingSid(self)
    }
    #[inline]
    pub unsafe fn getCallingUid(&self) -> uid_t {
        android_IPCThreadState_getCallingUid(self)
    }
    #[inline]
    pub unsafe fn setStrictModePolicy(&mut self, policy: i32) {
        android_IPCThreadState_setStrictModePolicy(self, policy)
    }
    #[inline]
    pub unsafe fn getStrictModePolicy(&self) -> i32 {
        android_IPCThreadState_getStrictModePolicy(self)
    }
    #[inline]
    pub unsafe fn setCallingWorkSourceUid(&mut self, uid: uid_t) -> i64 {
        android_IPCThreadState_setCallingWorkSourceUid(self, uid)
    }
    #[inline]
    pub unsafe fn setCallingWorkSourceUidWithoutPropagation(&mut self, uid: uid_t) -> i64 {
        android_IPCThreadState_setCallingWorkSourceUidWithoutPropagation(self, uid)
    }
    #[inline]
    pub unsafe fn getCallingWorkSourceUid(&self) -> uid_t {
        android_IPCThreadState_getCallingWorkSourceUid(self)
    }
    #[inline]
    pub unsafe fn clearCallingWorkSource(&mut self) -> i64 {
        android_IPCThreadState_clearCallingWorkSource(self)
    }
    #[inline]
    pub unsafe fn restoreCallingWorkSource(&mut self, token: i64) {
        android_IPCThreadState_restoreCallingWorkSource(self, token)
    }
    #[inline]
    pub unsafe fn clearPropagateWorkSource(&mut self) {
        android_IPCThreadState_clearPropagateWorkSource(self)
    }
    #[inline]
    pub unsafe fn shouldPropagateWorkSource(&self) -> bool {
        android_IPCThreadState_shouldPropagateWorkSource(self)
    }
    #[inline]
    pub unsafe fn setLastTransactionBinderFlags(&mut self, flags: i32) {
        android_IPCThreadState_setLastTransactionBinderFlags(self, flags)
    }
    #[inline]
    pub unsafe fn getLastTransactionBinderFlags(&self) -> i32 {
        android_IPCThreadState_getLastTransactionBinderFlags(self)
    }
    #[inline]
    pub unsafe fn clearCallingIdentity(&mut self) -> i64 {
        android_IPCThreadState_clearCallingIdentity(self)
    }
    #[inline]
    pub unsafe fn restoreCallingIdentity(&mut self, token: i64) {
        android_IPCThreadState_restoreCallingIdentity(self, token)
    }
    #[inline]
    pub unsafe fn setupPolling(&mut self, fd: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int {
        android_IPCThreadState_setupPolling(self, fd)
    }
    #[inline]
    pub unsafe fn handlePolledCommands(&mut self) -> android_status_t {
        android_IPCThreadState_handlePolledCommands(self)
    }
    #[inline]
    pub unsafe fn flushCommands(&mut self) {
        android_IPCThreadState_flushCommands(self)
    }
    #[inline]
    pub unsafe fn joinThreadPool(&mut self, isMain: bool) {
        android_IPCThreadState_joinThreadPool(self, isMain)
    }
    #[inline]
    pub unsafe fn stopProcess(&mut self, immediate: bool) {
        android_IPCThreadState_stopProcess(self, immediate)
    }
    #[inline]
    pub unsafe fn transact(
        &mut self,
        handle: i32,
        code: u32,
        data: *const android_Parcel,
        reply: *mut android_Parcel,
        flags: u32,
    ) -> android_status_t {
        android_IPCThreadState_transact(self, handle, code, data, reply, flags)
    }
    #[inline]
    pub unsafe fn incStrongHandle(&mut self, handle: i32, proxy: *mut android_BpBinder) {
        android_IPCThreadState_incStrongHandle(self, handle, proxy)
    }
    #[inline]
    pub unsafe fn decStrongHandle(&mut self, handle: i32) {
        android_IPCThreadState_decStrongHandle(self, handle)
    }
    #[inline]
    pub unsafe fn incWeakHandle(&mut self, handle: i32, proxy: *mut android_BpBinder) {
        android_IPCThreadState_incWeakHandle(self, handle, proxy)
    }
    #[inline]
    pub unsafe fn decWeakHandle(&mut self, handle: i32) {
        android_IPCThreadState_decWeakHandle(self, handle)
    }
    #[inline]
    pub unsafe fn attemptIncStrongHandle(&mut self, handle: i32) -> android_status_t {
        android_IPCThreadState_attemptIncStrongHandle(self, handle)
    }
    #[inline]
    pub unsafe fn expungeHandle(handle: i32, binder: *mut android_IBinder) {
        android_IPCThreadState_expungeHandle(handle, binder)
    }
    #[inline]
    pub unsafe fn requestDeathNotification(
        &mut self,
        handle: i32,
        proxy: *mut android_BpBinder,
    ) -> android_status_t {
        android_IPCThreadState_requestDeathNotification(self, handle, proxy)
    }
    #[inline]
    pub unsafe fn clearDeathNotification(
        &mut self,
        handle: i32,
        proxy: *mut android_BpBinder,
    ) -> android_status_t {
        android_IPCThreadState_clearDeathNotification(self, handle, proxy)
    }
    #[inline]
    pub unsafe fn shutdown() {
        android_IPCThreadState_shutdown()
    }
    #[inline]
    pub unsafe fn disableBackgroundScheduling(disable: bool) {
        android_IPCThreadState_disableBackgroundScheduling(disable)
    }
    #[inline]
    pub unsafe fn backgroundSchedulingDisabled(&mut self) -> bool {
        android_IPCThreadState_backgroundSchedulingDisabled(self)
    }
    #[inline]
    pub unsafe fn blockUntilThreadAvailable(&mut self) {
        android_IPCThreadState_blockUntilThreadAvailable(self)
    }
    #[inline]
    pub unsafe fn setTheContextObject(&mut self, obj: android_sp<android_BBinder>) {
        android_IPCThreadState_setTheContextObject(self, obj)
    }
    #[inline]
    pub unsafe fn getServingStackPointer(&self) -> *const ::std::os::raw::c_void {
        android_IPCThreadState_getServingStackPointer(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android15IServiceManager22getInterfaceDescriptorEv"]
    pub fn android_IServiceManager_getInterfaceDescriptor(
        this: *mut ::std::os::raw::c_void,
    ) -> *const android_String16;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android15IServiceManagerC2Ev"]
    pub fn android_IServiceManager_IServiceManager(this: *mut android_IServiceManager);
}
extern "C" {
    #[link_name = "\u{1}_ZN7android15IServiceManagerD1Ev"]
    pub fn android_IServiceManager_IServiceManager_destructor(this: *mut android_IServiceManager);
}
pub const android_IServiceManager_DUMP_FLAG_PRIORITY_CRITICAL: ::std::os::raw::c_int = 1;
pub const android_IServiceManager_DUMP_FLAG_PRIORITY_HIGH: ::std::os::raw::c_int = 2;
pub const android_IServiceManager_DUMP_FLAG_PRIORITY_NORMAL: ::std::os::raw::c_int = 4;
pub const android_IServiceManager_DUMP_FLAG_PRIORITY_DEFAULT: ::std::os::raw::c_int = 8;
pub const android_IServiceManager_DUMP_FLAG_PRIORITY_ALL: ::std::os::raw::c_int = 15;
pub const android_IServiceManager_DUMP_FLAG_PROTO: ::std::os::raw::c_int = 16;
#[repr(C)]
pub struct android_binder_Status {
    pub mException: i32,
    pub mErrorCode: i32,
    pub mMessage: android_String8,
}
pub const android_binder_Status_Exception_EX_NONE: android_binder_Status_Exception = 0;
pub const android_binder_Status_Exception_EX_SECURITY: android_binder_Status_Exception = -1;
pub const android_binder_Status_Exception_EX_BAD_PARCELABLE: android_binder_Status_Exception = -2;
pub const android_binder_Status_Exception_EX_ILLEGAL_ARGUMENT: android_binder_Status_Exception = -3;
pub const android_binder_Status_Exception_EX_NULL_POINTER: android_binder_Status_Exception = -4;
pub const android_binder_Status_Exception_EX_ILLEGAL_STATE: android_binder_Status_Exception = -5;
pub const android_binder_Status_Exception_EX_NETWORK_MAIN_THREAD: android_binder_Status_Exception =
    -6;
pub const android_binder_Status_Exception_EX_UNSUPPORTED_OPERATION:
    android_binder_Status_Exception = -7;
pub const android_binder_Status_Exception_EX_SERVICE_SPECIFIC: android_binder_Status_Exception = -8;
pub const android_binder_Status_Exception_EX_PARCELABLE: android_binder_Status_Exception = -9;
pub const android_binder_Status_Exception_EX_HAS_REPLY_HEADER: android_binder_Status_Exception =
    -128;
pub const android_binder_Status_Exception_EX_TRANSACTION_FAILED: android_binder_Status_Exception =
    -129;
pub type android_binder_Status_Exception = i32;
#[test]
fn bindgen_test_layout_android_binder_Status() {
    assert_eq!(
        ::std::mem::size_of::<android_binder_Status>(),
        16usize,
        concat!("Size of: ", stringify!(android_binder_Status))
    );
    assert_eq!(
        ::std::mem::align_of::<android_binder_Status>(),
        8usize,
        concat!("Alignment of ", stringify!(android_binder_Status))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_binder_Status>())).mException as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(android_binder_Status),
            "::",
            stringify!(mException)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<android_binder_Status>())).mErrorCode as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(android_binder_Status),
            "::",
            stringify!(mErrorCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<android_binder_Status>())).mMessage as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(android_binder_Status),
            "::",
            stringify!(mMessage)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status2okEv"]
    pub fn android_binder_Status_ok() -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status17fromExceptionCodeEi"]
    pub fn android_binder_Status_fromExceptionCode(exceptionCode: i32) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status17fromExceptionCodeEiRKNS_7String8E"]
    pub fn android_binder_Status_fromExceptionCode1(
        exceptionCode: i32,
        message: *const android_String8,
    ) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status17fromExceptionCodeEiPKc"]
    pub fn android_binder_Status_fromExceptionCode2(
        exceptionCode: i32,
        message: *const ::std::os::raw::c_char,
    ) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status24fromServiceSpecificErrorEi"]
    pub fn android_binder_Status_fromServiceSpecificError(
        serviceSpecificErrorCode: i32,
    ) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status24fromServiceSpecificErrorEiRKNS_7String8E"]
    pub fn android_binder_Status_fromServiceSpecificError1(
        serviceSpecificErrorCode: i32,
        message: *const android_String8,
    ) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status24fromServiceSpecificErrorEiPKc"]
    pub fn android_binder_Status_fromServiceSpecificError2(
        serviceSpecificErrorCode: i32,
        message: *const ::std::os::raw::c_char,
    ) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status11fromStatusTEi"]
    pub fn android_binder_Status_fromStatusT(status: android_status_t) -> android_binder_Status;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status17exceptionToStringB5cxx11Ei"]
    pub fn android_binder_Status_exceptionToString(exceptionCode: android_status_t) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status14readFromParcelERKNS_6ParcelE"]
    pub fn android_binder_Status_readFromParcel(
        this: *mut android_binder_Status,
        parcel: *const android_Parcel,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6binder6Status13writeToParcelEPNS_6ParcelE"]
    pub fn android_binder_Status_writeToParcel(
        this: *const android_binder_Status,
        parcel: *mut android_Parcel,
    ) -> android_status_t;
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status12setExceptionEiRKNS_7String8E"]
    pub fn android_binder_Status_setException(
        this: *mut android_binder_Status,
        ex: i32,
        message: *const android_String8,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status23setServiceSpecificErrorEiRKNS_7String8E"]
    pub fn android_binder_Status_setServiceSpecificError(
        this: *mut android_binder_Status,
        errorCode: i32,
        message: *const android_String8,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN7android6binder6Status14setFromStatusTEi"]
    pub fn android_binder_Status_setFromStatusT(
        this: *mut android_binder_Status,
        status: android_status_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK7android6binder6Status9toString8Ev"]
    pub fn android_binder_Status_toString8(this: *const android_binder_Status) -> android_String8;
}
impl android_binder_Status {
    #[inline]
    pub unsafe fn ok() -> android_binder_Status {
        android_binder_Status_ok()
    }
    #[inline]
    pub unsafe fn fromExceptionCode(exceptionCode: i32) -> android_binder_Status {
        android_binder_Status_fromExceptionCode(exceptionCode)
    }
    #[inline]
    pub unsafe fn fromExceptionCode1(
        exceptionCode: i32,
        message: *const android_String8,
    ) -> android_binder_Status {
        android_binder_Status_fromExceptionCode1(exceptionCode, message)
    }
    #[inline]
    pub unsafe fn fromExceptionCode2(
        exceptionCode: i32,
        message: *const ::std::os::raw::c_char,
    ) -> android_binder_Status {
        android_binder_Status_fromExceptionCode2(exceptionCode, message)
    }
    #[inline]
    pub unsafe fn fromServiceSpecificError(serviceSpecificErrorCode: i32) -> android_binder_Status {
        android_binder_Status_fromServiceSpecificError(serviceSpecificErrorCode)
    }
    #[inline]
    pub unsafe fn fromServiceSpecificError1(
        serviceSpecificErrorCode: i32,
        message: *const android_String8,
    ) -> android_binder_Status {
        android_binder_Status_fromServiceSpecificError1(serviceSpecificErrorCode, message)
    }
    #[inline]
    pub unsafe fn fromServiceSpecificError2(
        serviceSpecificErrorCode: i32,
        message: *const ::std::os::raw::c_char,
    ) -> android_binder_Status {
        android_binder_Status_fromServiceSpecificError2(serviceSpecificErrorCode, message)
    }
    #[inline]
    pub unsafe fn fromStatusT(status: android_status_t) -> android_binder_Status {
        android_binder_Status_fromStatusT(status)
    }
    #[inline]
    pub unsafe fn exceptionToString(exceptionCode: android_status_t) -> std_string {
        android_binder_Status_exceptionToString(exceptionCode)
    }
    #[inline]
    pub unsafe fn readFromParcel(&mut self, parcel: *const android_Parcel) -> android_status_t {
        android_binder_Status_readFromParcel(self, parcel)
    }
    #[inline]
    pub unsafe fn writeToParcel(&self, parcel: *mut android_Parcel) -> android_status_t {
        android_binder_Status_writeToParcel(self, parcel)
    }
    #[inline]
    pub unsafe fn setException(&mut self, ex: i32, message: *const android_String8) {
        android_binder_Status_setException(self, ex, message)
    }
    #[inline]
    pub unsafe fn setServiceSpecificError(
        &mut self,
        errorCode: i32,
        message: *const android_String8,
    ) {
        android_binder_Status_setServiceSpecificError(self, errorCode, message)
    }
    #[inline]
    pub unsafe fn setFromStatusT(&mut self, status: android_status_t) {
        android_binder_Status_setFromStatusT(self, status)
    }
    #[inline]
    pub unsafe fn toString8(&self) -> android_String8 {
        android_binder_Status_toString8(self)
    }
}
pub type nsecs_t = i64;
#[repr(C)]
pub struct native_handle {
    pub version: ::std::os::raw::c_int,
    pub numFds: ::std::os::raw::c_int,
    pub numInts: ::std::os::raw::c_int,
    pub data: __IncompleteArrayField<::std::os::raw::c_int>,
}
#[test]
fn bindgen_test_layout_native_handle() {
    assert_eq!(
        ::std::mem::size_of::<native_handle>(),
        12usize,
        concat!("Size of: ", stringify!(native_handle))
    );
    assert_eq!(
        ::std::mem::align_of::<native_handle>(),
        4usize,
        concat!("Alignment of ", stringify!(native_handle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<native_handle>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(native_handle),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<native_handle>())).numFds as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(native_handle),
            "::",
            stringify!(numFds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<native_handle>())).numInts as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(native_handle),
            "::",
            stringify!(numInts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<native_handle>())).data as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(native_handle),
            "::",
            stringify!(data)
        )
    );
}
pub type binder_size_t = ::std::os::raw::c_ulonglong;
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
#[test]
fn __bindgen_test_layout_android_sp_open0_android_IInterface_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<android_sp<android_IInterface>>(),
        8usize,
        concat!(
            "Size of template specialization: ",
            stringify!(android_sp<android_IInterface>)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<android_sp<android_IInterface>>(),
        8usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(android_sp<android_IInterface>)
        )
    );
}
#[test]
fn __bindgen_test_layout_android_sp_open0_android_IBinder_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<android_sp<android_IBinder>>(),
        8usize,
        concat!(
            "Size of template specialization: ",
